[
    {
        "Headline": "Google Podcasts is shutting down soon, users urged to move to YouTube Music",
        "Content": "Google is shutting down its Podcasts app in the U.S. in a matter of days. The company has begun warning the app's users they will need to migrate their subscriptions to YouTube Music by April 2 to follow and stream their favorite shows going forward. Users who don't make the move immediately will still have additional time to migrate, but will no longer be able to stream from the Podcasts app directly after this date.The Google Podcasts app, installed over 500 million times on Android devices globally, for over half a decade has offered a simple and streamlined interface for discovering, following and listening to podcasts, as well as tools to add podcasts by RSS feed. Unfortunately for fans of the app, the tech giant said last September it would begin to wind down the Podcasts app in early 2024 as part of its broader plan to centralize its audio services under YouTube.In 2020, YouTube Music offered a similar transition strategy to move music listeners away from Google Play Music ahead of its shutdown that same year. However, the Google Podcasts app continued to be maintained for years because YouTube Music wasn't ready to support podcasts until more recently. By the end of 2023, YouTube Music was able to support podcasts globally, and, by February, they had the ability to upload their RSS feeds, too.The move to shift podcasting over to YouTube could help Google become a bigger player in the space, not only by combining its efforts and sharpening its focus, but also because interest in video podcasts -- which were already popular on YouTube -- is on the rise. This week, for example, Spotify forged a deal with Universal Music Group (UMG) to bring video podcasts to U.S. users of its streaming app after earlier in March announcing tests of video podcasts in 11 other markets around the world.Bleeping Computer was the first to notice the shutdown date for Google Podcasts in the U.S., and a support page on Google's site confirms that users in the U.S. will only be able to use the Podcasts app through the end of March 2024. For those who miss the in-app pop-ups, Google will offer users additional time to save their subscriptions by allowing them to use the app's export feature through July 2024.Story continuesGoogle did not immediately return a request for comment, but after publication did respond to say that while it was still \"tracking towards\" the April 2 timeline for the U.S., it has not shared a timeline for the rest of the world yet.From its earlier statements, though, the plan is to discontinue Google Podcasts globally in 2024.After spat with TikTok, UMG expands Spotify partnership to include music videos and moreUpdated, 3/29/24, 5:00 PM ET with Google comment.This article originally appeared on TechCrunch at https://techcrunch.com/2024/03/29/google-pushes-podcasts-users-in-u-s-to-move-to-youtube-music-by-april-2/"
    },
    {
        "Headline": "These Are The Best Robinhood Stocks To Buy Or Watch Now",
        "Content": "Buying a stock is easy, but purchasing the right stock without a proven strategy is incredibly hard. Here are the best Robinhood stocks to buy now.Continue reading"
    },
    {
        "Headline": "25 Best Asana Alternatives & Competitors for Project Management in 2024",
        "Content": "In this article, we will take a look at the 25 best Asana alternatives and competitors for project management in 2024. If you want to skip our detailed analysis, you can go directly to 5 Best Asana Alternatives & Competitors for Project Management in 2024.Why is Asana a Leading Project Management ToolAsana, Inc. (NYSE:ASAN) is a leading project management software provider based in California, United States. The software provides management tools for operations, marketing, IT, planning, goal management, and global management. Users can break large projects into smaller achievable tasks, organize tasks to work with teams in the shared hub, create Gantt charts and timelines, and add labels to customize project boards. The platform is used by over 100,000 organizations across the globe. Users can collaborate with up to 10 people for free. The starter package is available for $10.99 and is for organizations with up to 500 team members. Large enterprises with more than 500 employees can contact the Asana sales team to set up a plan. You can also read our piece on the best marketing software for small businesses.On March 19, Asana, Inc. (NYSE:ASAN) launched a new suite of tools for the CIO. The new tools are backed by artificial intelligence. By the second quarter of 2024, users will be able to enjoy Microsoft 365 integrations to centralize data. Users can create automated workflows between Asana and Outlook Calendar to schedule tasks and manage projects. Users will also be able to leverage AI to draft goals and standardize them for the entire organization. By Q3 of 2024, users will be able to deploy workflows, establish change management, and employ improvements.On March 11, Asana, Inc. (NYSE:ASAN) reported earnings for the fiscal fourth quarter of 2024. The company reported revenue worth $171.14 million during the quarter, ahead of market consensus by $3.12 million and up 13.91% year-over-year. Here are some comments from Asana, Inc.'s (NYSE:ASAN) Q4 2024 earnings call:Story continues\"We’ll soon be launching new innovations like a Workflow console, deeper integrations with Microsoft 365, and ways to intelligently draft and standardize goals across the entire organization. We’re helping CIOs deploy trusted AI across every department with the right safeguards and transparent controls, with features like Sandboxes, Multi-Org deployments, and AI-powered custom onboarding, designed to support companies at scale. The pace of change is only going to accelerate in this new AI age, and we believe we are extremely well positioned to capture this opportunity, thanks to our investment in the Work Graph data model and our incredibly scalable architecture that is proven to support 200,000-plus seat deployments within a single organization.\"Tools Tech Giants Offer to Streamline WorkflowsMicrosoft Corporation (NASDAQ:MSFT) and Alphabet Inc. (NASDAQ:GOOG) offer workspace tools that can be used along with project management software to fully optimize business operations. You can also take a look at the highest paying countries for project managers.Microsoft Corporation (NASDAQ:MSFT) allows users to easily plan projects and collaborate using the Microsoft Project Management Software. Microsoft Corporation (NASDAQ:MSFT) offers both cloud-based solutions and on-premises solutions. Project Plan 1 is available for $10 per user per month. It allows companies to create projects, task boards, and Gantt charts. Project Plan 3 is available for $30 per user per month and provides additional features such as resource management. Project Plan 5 is available for $55 per user per month. It offers enterprise resource planning, demand management, and portfolio optimization along with the basic tools in Project Plans 1 and 3.Alphabet Inc. (NASDAQ:GOOG) offers tools for companies to manage workflows and projects. Google Workspace is a product of Alphabet Inc. (NASDAQ:GOOG). It provides companies with a customized business email along with collaborative tools such as Gmail, Calendar, Meet, Chat, and Drive. Users can also integrate Gemini to streamline workflows. The Business Starter plan is available for $6 per user per month and provides 30GB of pooled storage per user along with a customized business email. The business standard plan is available for $12 per user per month and offers companies 2TB of pooled storage data per user. The Business Plus plan is priced at $18 per month and offers eDiscovery and retention tools and 5TB of pooled storage per user, along with the basic features offered in the Starter and Standard plans.Now we have discussed the best workflow optimization tools, let's take a look at the 25 best Asana alternatives and competitors for project management. You can also read our piece on the best AI marketing tools for coporations.25 Best Asana Alternatives & Competitors for Project Management in 202425 Best Asana Alternatives & Competitors for Project Management in 2024Our MethodologyTo come up with the 25 best Asana alternatives and competitors for project management, we employed a consensus approach. We consulted more than 10 rankings on the internet to aggregate the best alternatives to Asana. Of them, we picked items that appeared in 50% of our sources. We then ranked our items based on the average customer star rating and the total number of reviews across four sources including G2, Capterra, GetApp, and TrustPilot. It is to be noted that we only included software with total reviews of more than 1,000 and an average customer star rating of at least 4.0. Our list of the 25 best Asana alternatives and competitors for project management is in ascending order of the average customer star rating as a primary metric, and the total number of reviews as a secondary metric.25 Best Asana Alternatives & Competitors for Project Management in 202425. TeamworkAverage Rating: 4.07Total Reviews: 1,193Teamwork is an all-in-one customized project management platform. The tools allow users to organize projects, track time, manage timelines, and create reports. Teams can access the platform with a 30-day free trial.24. Bitrix24Average Rating: 4.08Total Reviews: 2,273Bitrix24 ranks 24th on our list of the best alternatives to Asana for project management. Teams can manage projects, create Gantt charts, automate sales, create boards, and track time. More than 15 million organizations use the platform.23. KantataAverage Rating: 4.13Total Reviews: 2,069Kantata's project management software allows users to manage data-backed insights and create projects. Users can also use the platform to forecast and predict future trends. It also provides a time-tracking functionality.22. BasecampAverage Rating: 4.15Total Reviews: 20,968Basecamp is one of the best project management software providers. Basecamp is also functional as a mobile application and has a customer star rating of 4.7 on the Google Play Store based on 17,101 reviews, as of March 28. Users can create boards, manage documents, and delegate tasks.21. ProjectManagerAverage Rating: 4.20Total Reviews: 1,503ProjectManager is a leading project management tool enabling team planning, task tracking, and online collaboration. More than 35,000 teams use the platform to create agile projects. Users can store project documents, set guardrails, and automate workflows to save time.20. WrikeAverage Rating: 4.23Total Reviews: 7,590Wrike ranks 20th on our list of the best alternatives to Asana for project management. Users can manage projects and view them in board form, table form, and in the form of a Gantt chart. It also automates workflows to minimize time spent on task management.19. SmartsheetAverage Rating: 4.27Total Reviews: 16,482Smartsheet allows users to manage projects, automate processes, and scale programs. Users can create boards and prioritize tasks, manage deliverables, and integrate with other prominent software including Slack, Microsoft Teams, and Webex, among others.18. TrelloAverage Rating: 4.30Total Reviews: 39,369Trello is one of the best project management alternatives to Asana. Users can create simple boards, visualize ideas, integrate applications, and streamline workflows. The platform provides users with productivity metrics, calendars, and timelines.17. ConfluenceAverage Rating: 4.32Total Reviews: 6,542Confluence is one of the best tools for project management with an immense focus on collaboration. The software allows users to organize pages, attach documents, collaborate in real time, assign tasks, and customize existing templates.16. PodioAverage Rating: 4.33Total Reviews: 1,268Podio creates workflows for teams to ensure every team member is on the same page. Users are able to fully customize the software to suit team needs. Users can manage projects, track progress, set meetings, and manage files.15. ActiveCollabAverage Rating: 4.37Total Reviews: 1,438ActiveCollab ranks 15th on our list of the best alternatives to Asana for project management. The tool is used by more than 50,000 teams. Teams can view tasks and their deadlines, establish processes, and track task progress.14. HubspotAverage Rating: 4.38  Total Reviews: 19,632Hubspot's project/campaign management tools allow users to view, manage, and execute campaigns. Users can create tasks, view progress, collaborate with other team members, and assess performance.13. HiveAverage Rating: 4.40Total Reviews: 27,259Hive ranks as one of the best project management tools for teams. Users can manage projects, track progress on tasks, and collaborate with other team members. Users can also view tasks in the Kanban view, the Gantt view, the table view, and the portfolio view.12. JiraAverage Rating: 4.40Total Reviews: 32,735Jira for project management ranks 12th on our list of the best alternatives to Asana. More than 250,000 teams use Jira to manage projects and teams. Users can create agile boards to break down complex projects into achievable targets, manage timelines, and garner crucial insights.11. TodoistAverage Rating: 4.48Total Reviews: 3,368More than 42 million people and teams across the globe use Todoist to organize workloads. The task manager allows people to create and prioritize tasks and set due dates. Users can also break projects into subtasks, set reminders, and share projects with other users.10. FreedcampAverage Rating: 4.50Total Reviews: 1,328Freedcamp is a free project management software that allows businesses to streamline projects, establish processes and workflows, track time, and solve issues. More than 285,000 individuals and over 150,000 teams use Freedcamp.9. ClickUpAverage Rating: 4.52Total Reviews: 14,634ClickUp is one of the best alternatives to Asana. The software is an all-in-one solution to manage tasks, collaborate with other team members, create dashboards, and manage sprints. More than 2 million teams use ClickUp to collaborate.8. NotionAverage Rating: 4.53Total Reviews: 5,891Notion ranks eight on our list of the best alternatives to Asana for project management. Notion is an all in one workspace for businesses. Notion can be used for both internal project management and client management. It offers a variety of customizable templates.7. WorkzoneAverage Rating: 4.57Total Reviews: 2,543The Workzone agency project management software allows users to manage clients and projects. The team plan is available for $24 per user per month, recommended for organizations with 5 or more team members. The plan allows users to create Gantt charts and manage unlimited projects.6. ScoroAverage Rating: 4.60Total Reviews: 1,260Scoro ranks sixth on our list of the best project management alternatives to Asana. The software as a service (SaaS) solution allows companies to manage projects, delegate tasks, plan resources, track time, create invoices, and manage customers.Click to continue reading and see 5 Best Asana Alternatives & Competitors for Project Management in 2024.Suggested articles:Disclosure: None. 25 Best Asana Alternatives & Competitors for Project Management in 2024 is originally published on Insider Monkey."
    },
    {
        "Headline": "13 Best Growth ETFs To Buy Now",
        "Content": "In this article, we discuss 13 best growth ETFs to buy now. If you want to skip our discussion on growth investing, check out 5 Best Growth ETFs To Buy Now. When interest rates went up in 2023, things changed. Companies had to rethink their plans and prioritize financial resilience over mere growth. Despite two years of interest rate increases causing some disruptions, the global economy has stayed strong regardless of persistent inflation. Developed economies in the West might see ongoing lower inflation as they move from a slow start to an economic recovery later in the year. Even though interest rates rose quickly in 2022 and 2023, many developed countries continued to grow, showing signs of strain only recently. For 2024, Invesco predicts a slight global economic slowdown, especially during the first half of the year. The United States has been resilient compared to the slowing growth in the eurozone and the UK. However, Invesco expects this slowdown to be short-lived as monetary policy adjusts to falling inflation. The firm believes that major central banks in developed countries have likely finished hiking interest rates and will start cutting them as growth slows and inflation calms down. This should help the economy recover towards normal growth in the second half of 2024 as people's wages rise due to lower inflation.During economic downturns, value stocks, which are generally cheaper than growth stocks, often suffer significant declines due to investor concerns. However, they tend to perform well as the economy begins to recover. Interestingly, the rebound of value stocks following the COVID-19 pandemic was not as strong as expected. This could be because investors in 2023 anticipated a recession that did not occur. Additionally, the anticipated fiscal spending in 2024 from government acts like the Infrastructure Investment and Jobs Act, CHIPS Act, and Inflation Reduction Act could boost sectors like finance and industrials. On the other hand, the recovery in 2023 also revived growth stocks following the downturn in 2022. Therefore, Morgan Stanley suggests that investors looking to add value stocks to their portfolios should not do so at the expense of growth stocks, which still offer potential in areas like consumer discretionary and technology. Investors might also want to consider reducing their exposure to defensive sectors such as consumer staples, healthcare, and utilities. While these sectors were favored during the bear market in 2022, they did not perform as well when the stock market rebounded in 2023 and may continue to underperform in 2024.Story continuesAccording to Matt Orton, chief market strategist at Raymond James Investment Management, investors should overlook concerns regarding elevated valuations and instead concentrate on growth in what he described as a \"stockpicker's market.\" He pointed out that a significant portion of the recent market surge has been driven by the \"Magnificent 7\" mega-cap tech stocks, but they are now exhibiting varying performance trends. While there has been extensive discussion about the lofty valuations of US stocks, Orton argued that making historical comparisons may not be applicable. This is because today's market makeup is distinct, with growth stocks anticipated to achieve higher-than-average earnings growth rates, often due to their involvement in rapidly advancing sectors like technology and AI, or because they offer distinctive products or services that confer a competitive advantage, such as healthcare firms with highly sought-after weight loss medications. Matt Orton commented: “I fully think that the market could push 20, 21 times, and that’s a perfectly fair multiple for us to pay. It’s all about earnings growth and it’s all about leaning into where those fundamentals are, and trying to avoid the parts of the market where you don’t have a positive inflection in earnings. And if you do that, no matter what the valuation is, you can grow into it, and I think that’s the main message for investors, is ‘find growth.’”Some of the best growth stocks to buy include Mastercard Incorporated (NYSE:MA), Broadcom Inc. (NASDAQ:AVGO), and Tesla, Inc. (NASDAQ:TSLA). However, we discuss the best growth ETFs in this article, which offer investors exposure to multiple growth stocks in a single investment vehicle. Our Methodology We curated our list of the best growth ETFs by choosing consensus picks from multiple credible websites. We have mentioned the 5-year share price performance of each ETF as of March 27, 2024, ranking the list in ascending order of the share price. We have also discussed the top holdings of the ETFs to offer better insight to potential investors.13 Best Growth ETFs To Buy NowPhoto by Adam Nowakowski on UnsplashBest Growth ETFs To Buy Now13. Wisdomtree U.S. Quality Growth Fund (NYSE:QGRW)5-Year Share Price Performance as of March 27: 71.13%Wisdomtree U.S. Quality Growth Fund (NYSE:QGRW) aims to replicate the performance of the WisdomTree U.S. Quality Growth Index, excluding fees and expenses. It invests in large to mid-sized American companies known for their robust quality and growth attributes. As of March 26, 2024, Wisdomtree U.S. Quality Growth Fund (NYSE:QGRW) net assets worth approximately $320 million, featuring an expense ratio of 0.28%. Wisdomtree U.S. Quality Growth Fund (NYSE:QGRW) is one of the best growth ETFs to invest in. Microsoft Corporation (NASDAQ:MSFT) is the largest holding of Wisdomtree U.S. Quality Growth Fund (NYSE:QGRW). J.P. Morgan, with an Overweight rating and a $440 price target for Microsoft Corporation (NASDAQ:MSFT) shares on March 14, highlighted the impact of Microsoft's Copilot for Security AI chatbot on the company's security capabilities, noting a paradigm shift. According to Insider Monkey’s fourth quarter database, 302 hedge funds were bullish on Microsoft Corporation (NASDAQ:MSFT), compared to 306 funds in the prior quarter. Like Mastercard Incorporated (NYSE:MA), Broadcom Inc. (NASDAQ:AVGO), and Tesla, Inc. (NASDAQ:TSLA), Microsoft Corporation (NASDAQ:MSFT) is one of the best growth stocks to invest in. Carillon Eagle Growth & Income Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter:“Microsoft Corporation (NASDAQ:MSFT) performed well after reporting strong earnings supported by accelerated growth from Azure. The cloud business is seeing consistent trends from optimization while AI has contributed strongly to its growth.”12. Vanguard Mega Cap Growth Index Fund (NYSE:MGK)5-Year Share Price Performance as of March 27: 78.30%Vanguard Mega Cap Growth Index Fund (NYSE:MGK) ranks 12th on our list of the best growth ETFs. Vanguard Mega Cap Growth Index Fund (NYSE:MGK) aims to replicate the CRSP US Mega Cap Growth Index's performance through a passively managed, full-replication strategy. It offers investors a convenient way to gain diversified exposure to the largest growth stocks in the US market. The ETF was established on December 17, 2007. The fund’s expense ratio, as of December 22, 2023, stands at 0.07%. Vanguard Mega Cap Growth Index Fund (NYSE:MGK)’s portfolio holds 82 stocks, along with net assets of $18.6 billion as of February 29, 2024. Vanguard Mega Cap Growth Index Fund (NYSE:MGK)’s top holdings include Apple Inc. (NASDAQ:AAPL). On March 26, Tencent agreed to provide key apps for Apple's Vision Pro mixed-reality headset in China, including messaging app WeChat and a popular video-streaming service. Apple's push for a streaming service in China faces challenges due to censorship regulations, necessitating a domestic partnership. Despite hurdles, Apple aims to strengthen its presence in China, which is a crucial market. Chinese companies like ByteDance have already introduced apps for Vision Pro outside China, indicating potential for further collaborations.According to Insider Monkey’s fourth quarter database, 131 hedge funds were long Apple Inc. (NASDAQ:AAPL), compared to 134 funds in the last quarter. Horizon Kinetics stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter:“The full point is that if BYD has turned its attention from its domestic market to direct global competition, then other Chinese companies can do the same. The next most visible example of Chinese commercially applied technological prowess relates to the 2nd highest-weight company in the S&P 500, Apple Inc. (NASDAQ:AAPL).In September 2023, Huawei Technologies introduced its Mate 60 Pro smartphone. It uses its own, internally developed 5G enabled chip that is apparently competitive with the Apple A17 chip. For practical purposes it has the functionality of the iPhone 15 Pro. This came as a great surprise – perhaps even shock – to the U.S. technology community, because four years ago the U.S. placed strict sanctions on China’s access to state-of-the-art semiconductor manufacturing technology…” (Click here to read the full text)11. Fidelity Blue Chip Growth ETF (BATS:FBCG)5-Year Share Price Performance as of March 27: 88.55%Fidelity Blue Chip Growth ETF (BATS:FBCG) follows a domestic equity growth strategy primarily focused on large-cap companies. The fund seeks companies with strong earnings growth potential and sustainable business models that are potentially undervalued by the market in terms of growth rate or longevity. As of December 31, 2023, Fidelity Blue Chip Growth ETF (BATS:FBCG)’s gross expense ratio is 0.59%, and its portfolio consists of 158 stocks. It is one of the best growth ETFs to invest in. NVIDIA Corporation (NASDAQ:NVDA) is one of the top holdings of Fidelity Blue Chip Growth ETF (BATS:FBCG). NVIDIA Corporation (NASDAQ:NVDA) revealed its new Blackwell GPU platform at its annual GTC developer conference, sparking optimism from UBS about a potential surge in demand, especially from the UAE, Saudi Arabia, Sweden, Japan, Korea, and Malaysia. UBS analyst Timothy Arcuri predicts that NVIDIA Corporation (NASDAQ:NVDA) could reach $150 billion in revenue by 2025, a 30% increase year-over-year. Despite concerns about supply and meeting Wall Street estimates, Arcuri raised NVIDIA Corporation (NASDAQ:NVDA)’s price target to $1,100 on March 22, viewing any near-term weakness as a buying opportunity given the company's growth prospects.According to Insider Monkey’s fourth quarter database, 173 hedge funds were bullish on NVIDIA Corporation (NASDAQ:NVDA), compared to 180 funds in the last quarter. Orbis Global Equity Strategy stated the following regarding NVIDIA Corporation (NASDAQ:NVDA) in its fourth quarter 2023 investor letter:“Never before has following the crowd made so much money. Nor, in our estimation, so little sense. But just look at the opportunities the crowd has left for those of us willing to take a different view. We could wax lyrical about the glaring difference in value between Korean banks priced at 4 times earnings, versus Apple at 28 times, despite diverging fundamentals—Apple is increasingly at risk of bans in China, while Korean banks could double their dividends.Or how the thick margin of safety at Intel, backed by listed stakes and real saleable assets, compares to the slim margin for error at NVIDIA Corporation (NASDAQ:NVDA), trading at 13 times next year’s projected revenue. That revenue that could be competed away over time, while Intel’s semiconductor “fabs” in the US are increasingly valuable as the east and the west drift further apart.”10. iShares Core S&P U.S. Growth ETF (NASDAQ:IUSG)5-Year Share Price Performance as of March 27: 94.08%iShares Core S&P U.S. Growth ETF (NASDAQ:IUSG) ranks 10th on our list of the best growth ETFs. The fund aims to replicate the performance of the S&P 900 Growth Index, which consists of large and mid-cap US equities with growth attributes. As of March 26, 2024, iShares Core S&P U.S. Growth ETF (NASDAQ:IUSG) holds net assets worth $16.8 billion, featuring an expense ratio of 0.04% and a portfolio of 471 stocks. Amazon.com, Inc. (NASDAQ:AMZN) is one of the largest holdings of iShares Core S&P U.S. Growth ETF (NASDAQ:IUSG). On March 27, Amazon.com, Inc. (NASDAQ:AMZN) revealed that it is making a significant financial commitment to AI technology with a $2.75 billion strategic investment in Anthropic. It has now invested $4 billion in Anthropic. Anthropic's Claude 3 chatbot competes with Microsoft-backed OpenAI's ChatGPT. This marks Amazon.com, Inc. (NASDAQ:AMZN)’s largest outside investment since $1.3 billion in EV-maker Rivian. According to Insider Monkey’s fourth quarter database, 293 hedge funds were bullish on Amazon.com, Inc. (NASDAQ:AMZN), compared to 286 funds in the last quarter. Alger Spectra Fund stated the following regarding Amazon.com, Inc. (NASDAQ:AMZN) in its fourth quarter 2023 investor letter:“Amazon.com, Inc. (NASDAQ:AMZN) is a well-known online retailer and cloud computing leader. The company’s Amazon Web Services (AWS) business provides utility-scale cloud offerings that facilitate corporate America’s transition to digital systems. During the quarter, shares contributed to performance as Amazon reported strong fiscal third quarter results, where the company beat sales and earnings estimates. Moreover, AWS growth remained steady. contributing to Amazon’s better-than-expected operating income despite concerns around cloud cost optimizations, showing signs of increasing net new cloud workloads. While management noted that customers remain price-conscious and focused on deals, demand remains strong across all segments, leading the company to raise their fiscal fourth quarter revenue and operating income guidance.”9. iShares S&P 500 Growth ETF (NYSE:IVW)5-Year Share Price Performance as of March 27: 95.92%iShares S&P 500 Growth ETF (NYSE:IVW) aims to replicate the performance of the S&P 500 Growth Index, which consists of large-cap US equities displaying growth attributes. As of March 26, 2024, the fund’s net assets exceed $44 billion, featuring an expense ratio of 0.18%. Its portfolio consists of 227 stocks. iShares S&P 500 Growth ETF (NYSE:IVW) is one of the best growth ETFs to buy. Meta Platforms, Inc. (NASDAQ:META) is one of the top holdings of the iShares S&P 500 Growth ETF (NYSE:IVW). On March 18, Meta Platforms, Inc. (NASDAQ:META) shares increased by 1.4% in premarket trading following Mizuho Securities' designation of the tech giant as a top pick. Mizuho analyst James Lee maintains a Buy rating and a $575 price target on Meta, expecting fiscal 2024 revenue to surpass expectations due to improved monetization in Reels, geographic expansion, partnerships like Amazon's collaboration with Shops, and enhanced video placements. According to Insider Monkey’s fourth quarter database, 242 hedge funds were bullish on Meta Platforms, Inc. (NASDAQ:META), compared to 234 funds in the prior quarter. Artisan Value Fund stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its fourth quarter 2023 investor letter:“Netflix and Meta Platforms, Inc. (NASDAQ:META)—both categorized in the communication services sector—rounded out our top five contributors in Q4 as well as for 2023. Both stocks suffered sharp declines in 2022, each losing more than 50% of their market capitalizations. In 2022, we purchased Netflix and added to our position in Meta on weakness as both stocks were selling significantly below our estimates of fair value. Meta’s challenges were more self-inflicted as a ramp-up in spending caused free cash flow to plummet. We saw Netflix’s slowing subscriber growth as a normal feature of a maturing streaming market.With regard to Meta, the company’s “year of efficiency,” as 2023 was declared by Mark Zuckerberg, involved a recalibration of its spending plans to focus on profitability. While the stock also benefited from enthusiasm around artificial intelligence, the re-rating in the price multiple seems entirely rational as shares were selling for less than 10X next year’s estimated earnings at its 2022 lows for a business that still had strong growth drivers, consistent free cash flow generation and a large net cash position. While Meta is included in the Magnificent Seven mega-cap stocks, Meta is trading much cheaper (~25X P/E) than all the others aside from Alphabet (~24X P/E), which is the one other of the Magnificent Seven stocks we hold. While Meta’s stock is no longer extremely cheap, we feel it is still reasonably priced for a good business with attractive growth prospects. We did trim our positions in Meta and Netflix to put capital to work in names having greater discounts.”8. SPDR Portfolio S&P 500 Growth ETF (NYSE:SPYG)5-Year Share Price Performance as of March 27: 96.53%SPDR Portfolio S&P 500 Growth ETF (NYSE:SPYG) aims to mirror the performance of the S&P 500 Growth Index before fees and expenses. The index comprises stocks with the strongest growth attributes, determined by factors such as sales growth, earnings change to price ratio, and momentum. It ranks 8th on our list of the best growth ETFs. As of March 26, 2024, the fund has $24.8 billion in assets under management, offers a gross expense ratio of 0.04%, and features a portfolio comprising 227 stocks. Alphabet Inc. (NASDAQ:GOOG) is one of the top holdings of SPDR Portfolio S&P 500 Growth ETF (NYSE:SPYG). On March 22, Wedbush Securities added Alphabet Inc. (NASDAQ:GOOG) to its Best Ideas List and increased its price target on the shares to $175 from $160. According to Insider Monkey’s fourth quarter database, 166 hedge funds were bullish on Alphabet Inc. (NASDAQ:GOOG), compared to 163 funds in the prior quarter. Pershing Square Holdings stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:“In early 2023, we initiated an investment in Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, at a highly attractive valuation during a period when apprehension about the company’s competitive positioning in AI overshadowed the high-quality nature of its business and strong growth prospects.Since we initiated our position, the company has delivered impressive operating results. With two of the highest ROI and most resilient ad formats in Search and YouTube, Google occupies a dominant position in the secularly fast-growing digital advertising market. As the digital advertising market recovered over the course of the year, revenue growth in Google’s advertising business accelerated from 3% in Q1 2023 to 10% in Q4 2023. Moreover, the company realized significant progress on its substantial margin expansion opportunity and maintained a robust capital return program. In 2023, operating profit margins expanded by approximately 225 basis points (bps), excluding one-time severance and real estate charges, as the Cloud segment reached breakeven profitability. We expect continued cost control, automation efficiencies, and operating leverage in under-earning segments (Cloud & YouTube) to sustain margin expansion as Google invests behind AI initiatives.The company is using its ample free cash flow to repurchase approximately 4% of its outstanding shares on an annual basis…” (Click here to read the full text)7. Vanguard S&P 500 Growth Index Fund ETF Shares (NYSE:VOOG)5-Year Share Price Performance as of March 27: 97.03%Vanguard S&P 500 Growth Index Fund ETF Shares (NYSE:VOOG) invests in stocks within the S&P 500 Growth Index, which includes growth-oriented companies from the S&P 500. It aims to closely follow the index's performance, reflecting overall U.S. growth stock returns. Vanguard S&P 500 Growth Index Fund ETF Shares (NYSE:VOOG) ranks 7th on our list of the best growth ETFs. The ETF was established on September 7, 2010. The portfolio consists of 226 stocks, with net assets of $10 billion as of February 29, 2024 and an expense ratio of 0.10%. Eli Lilly and Company (NYSE:LLY) is one of the top holdings of Vanguard S&P 500 Growth Index Fund ETF Shares (NYSE:VOOG). Eli Lilly and Company (NYSE:LLY)’s 2024 guidance indicates revenue is forecasted between $40.4 billion to $41.6 billion, surpassing the consensus of $39.14 billion. EPS is expected to range from $11.80 to $12.30, and non-GAAP EPS from $12.20 to $12.70, compared to a $12.38 consensus. According to Insider Monkey’s fourth quarter database, 102 hedge funds were bullish on Eli Lilly and Company (NYSE:LLY), same as the prior quarter. Like Mastercard Incorporated (NYSE:MA), Broadcom Inc. (NASDAQ:AVGO), and Tesla, Inc. (NASDAQ:TSLA), Eli Lilly and Company (NYSE:LLY) is one of the best growth stocks to invest in. Aristotle Atlantic Core Equity Strategy stated the following regarding Eli Lilly and Company (NYSE:LLY) in its fourth quarter 2023 investor letter:“Eli Lilly and Company (NYSE:LLY) is a leading pharmaceutical company that develops diabetes, oncology, immunology and neuroscience medicines. The company generates over half of its revenue in the U.S. from its top-selling drugs Trulicity, Verzenio and Taltz. The company operates in a single business segment, Human pharmaceutical products.Eli Lilly has a deep pipeline in treatment areas focused on metabolic disorders, oncology, immunology and central nervous system disorders. Currently, there are two phase three assets, Orforglipron, an oral GLP-1 and retatrutide, a triple incretin agonist, which have the potential to expand upon the potential success of Mounjaro. We believe that Mounjaro has the potential to commercialize beyond type 2 diabetes and obesity, potentially in the areas mentioned above of heart disease, sleep apnea, fatty liver disease and chronic kidney disease. We believe the premium valuation is supported by this outsized growth profile.”6. Vanguard Growth Index Fund ETF Shares (NYSE:VUG)5-Year Share Price Performance as of March 27: 120.11%Vanguard Growth Index Fund ETF Shares (NYSE:VUG) aims to replicate the CRSP US Large Cap Growth Index's performance, offering investors an investment vehicle to mirror the performance of major growth stocks in the United States. It employs a passively managed, full-replication strategy. Vanguard Growth Index Fund ETF Shares (NYSE:VUG) is one of the best growth ETFs to buy. The fund was established on January 26, 2004. As of February 29, 2024, Vanguard Growth Index Fund ETF Shares (NYSE:VUG) holds $222.4 billion in net assets, with a portfolio of 208 stocks and an expense ratio of 0.04%. Tesla, Inc. (NASDAQ:TSLA) is one of the top holdings of Vanguard Growth Index Fund ETF Shares (NYSE:VUG). On March 27, Bradley Gerstner, CEO of Altimeter Capital, said that investing in Elon Musk as a \"no brainer,\" especially in the era of artificial intelligence where Musk is pioneering market-leading models. Gerstner recently bought Tesla, Inc. (NASDAQ:TSLA) stocks, emphasizing Musk's exceptional leadership as a product engineer. He highlighted Tesla's Full Self-Driving Beta v12 launch as a catalyst for his bullish outlook on the stock.According to Insider Monkey’s fourth quarter database, 82 hedge funds were bullish on Tesla, Inc. (NASDAQ:TSLA), compared to 81 funds in the last quarter. Alger Spectra Fund stated the following regarding Tesla, Inc. (NASDAQ:TSLA) in its fourth quarter 2023 investor letter:“Tesla, Inc. (NASDAQ:TSLA) is an electric vehicle manufacturer with a significant technological lead in its large and rapidly growing addressable market. Tesla is a transportation company that is setting the pace for industry innovation, in our view. During the quarter, the company reported weaker-than-expected fiscal third quarter earnings, where gross margins were negatively impacted by factory downtime and ramping production volumes at new manufacturing plants. However, the company noted that they remain confident by the amount of data that Tesla’s established and growing fleet of vehicles has gathered, which may bode well for the company’s full self-driving capabilities.”Click to continue reading and see 5 Best Growth ETFs To Buy Now.  Suggested articles: Disclosure: None. 13 Best Growth ETFs To Buy Now is originally published on Insider Monkey."
    },
    {
        "Headline": "Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 11 Stocks",
        "Content": "In this article, we will take a detailed look at Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 11 Stocks. For a quick overview of such stocks, read our article Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 5 Stocks.Jim Cramer in his latest program talked about CNBC's Alpha Stock Survey according to which a “majority” of investors believe the market is headed for a pullback. Cramer is not at all worried about a possible decline in the market.\"Hallelujah about that survey,\" Cramer said.Jim Cramer said that the S&P 500 is up 10% in the first three months of 2024, registering the best quarter since 2019. This makes Cramer believe that the market is indeed heading for a pullback. But he said we should “welcome it, not fear it.”Jim Cramer \"Welcomes\" Market Sell-OffsJim Cramer said that sell-offs are “inevitable.” He said even though we don’t know when they will hit, they are always expected and we should take them as buying opportunities. Cramer said he learned the concept of welcoming sell-offs from the legendary investor Peter Lynch, who famously said that you should expect a 10% pullback on average after every two years and a 25% “beatdown” every six years. Peter Lynch, Cramer reminded, said about 30 years ago that despite pullbacks and sell-offs the market tends to do well in the long term since according to his estimates corporate profits grow 8% per year. Lynch said the stock market follows corporate earnings and as a result made almost accurate predictions about the Dow Jones growing at about 8% per year.Cramer Thinks Market's \"Breadth Problem\" is SolvedJim Cramer also said that anyone who still “insists” that this market is just about major tech names like Apple Inc. (NASDAQ:AAPL), Amazon.com Inc. (NASDAQ:AMZN), Alphabet Inc. (NASDAQ:GOOG) and other Mag. 7 stocks, they should rethink since he believes there are “so many winners” in the market that “it’s insane.” Cramer believes the market no longer has the “breadth” problem because returns are expanding across the board, sometimes at the “expense” of mega-cap technology stocks.Story continuesJim Cramer thinks that it’s of no use to stay fixated on the Federal Reserve for now, with all indications saying the central bank is in no hurry to cut interest rates. Cramer wants investors to instead focus on earnings and the performance of individual companies. Cramer said we haven’t seen mass rounds of layoffs that many in the “hard landing” camp were expecting. He said we are prepared to see another hot jobs report, but if it comes softer-than-expected, we will go into the next earnings season with a “pleasant backdrop.”Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 11 StocksMethodologyFor this article we watched latest programs of Jim Cramer aired on CNBC over the past few days and picked 11 stocks he recommended investors to buy. With each stock we have mentioned the number of hedge fund investors. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here).11. New Fortress Energy Inc (NASDAQ:NFE)Number of Hedge Fund Investors: 24Jim Cramer hit the ‘Buy, Buy, Buy’ button on LNG company New Fortress Energy Inc (NASDAQ:NFE) during one of his recent programs on CNBC. Cramer said Wes Edens (New Fortress Energy Inc (NASDAQ:NFE) CEO) is “absolutely terrific at what he does.” Cramer said he likes the stock at the current levels.10. Samsara Inc (NYSE:IOT)Number of Hedge Fund Investors: 28Jim Cramer was recently asked about Samsara Inc (NYSE:IOT). Here’s what he said about the sock.“Oh my god, this is the hottest stock, it’s gonna make money too.”Cramer said that Samsara Inc (NYSE:IOT) is a “DevOps shop.” Cramer said that it’s a “hardware-software platform” and people “love these kinds of stocks” and they cannot “live without them.”Earlier this month, Samsara Inc (NYSE:IOT) posted Q4 results. Adjusted EPS in the period came in at $0.04, beating estimates by $0.01. Revenue in the period jumped 48.1% year over year to $276.27 million, beating estimates by $17.96 million.9. Rio Tinto Plc ADR Common Stock (NYSE:RIO)Number of Hedge Fund Investors: 34Jim Cramer thinks Rio Tinto Plc ADR Common Stock (NYSE:RIO) is a “great company to buy here.” Cramer said that this mineral company is a “terrific\" and \"really good\" idea.Over the past one year Rio Tinto Plc ADR Common Stock (NYSE:RIO) shares have gained about 4% over the past one year.Earlier this month, the stock was downgraded by Liberum to Hold from Buy amid softening demand and China-related concerns.8. Coherent Corp (NYSE:COHR)Number of Hedge Fund Investors: 35Pennsylvania-based  optical materials and semiconductors company Coherent Corp (NYSE:COHR) is one of the stocks Jim Cramer is recommending investors to buy. Cramer said Coherent Corp (NYSE:COHR) has “a lot of lasers, a lot of optics, a lot of good stuff.” Cramer said Coherent Corp (NYSE:COHR) is “gonna make money this year.” He said investors should buy some of Coherent Corp (NYSE:COHR) stock now and then wait for the stock to come down to buy some more.In addition to COHR, Cramer also likes Apple Inc. (NASDAQ:AAPL), Amazon.com Inc. (NASDAQ:AMZN) and Alphabet Inc. (NASDAQ:GOOG).As of the end of the fourth quarter of 2023, 35 hedge funds had stakes in Coherent Corp (NYSE:COHR).Diamond Hill Select Strategy stated the following regarding Coherent Corp. (NYSE:COHR) in its fourth quarter 2023 investor letter:“In addition to Diamondback Energy, we also initiated positions in Coherent Corp. (NYSE:COHR) and HCA Healthcare in Q4. Coherent supplies engineered materials and devices to semiconductor equipment companies, data center and telecom companies, and it also produces lasers for industrial applications. The company has a long history of successfully innovating in these areas and is well-positioned to benefit from demand for advanced transceivers as artificial intelligence (AI) investments increase. As near-term cyclical headwinds have weighed on the share price, we capitalized on what we view as an attractive price relative to our estimate of intrinsic value to initiate a position.”7. Pure Storage Inc (NYSE:PSTG)Number of Hedge Fund Investors: 37When asked about Pure Storage Inc (NYSE:PSTG), Cramer said that it’s making money and since the stock has run a lot, investors should buy some of it now and then wait for a pullback before buying more.Pure Storage Inc (NYSE:PSTG) shares have gained 50% year to date through March 29.During its earnings call last month, the company talked about shareholder returns and guidance:\"We have approximately $145 million remaining on our existing $250 million repurchase authorization, and we are announcing today a new share repurchase authorization of $250 million. Now turning to our guidance for FY ’25. We expect to return to double-digit revenue growth in FY ’25, growing 10.5% to $3.1 billion. We expect demand across our entire data storage platform will strengthen while also remaining cautious of the macro spending environment. Our annual revenue guide of 10.5% growth also contemplates approximately 50% growth in TCV sales for our collective Evergreen/One and Evergreen/Flex service offerings, which are expected to be $600 million.To help better understand the short-term impact that growth of our consumption and subscription offerings have on our annual revenue growth rate we estimate that our forecasted FY ’25 revenue growth would be in the mid-teens when adjusting for the expected growth of both our Evergreen/One and Evergreen/Flex service offerings. Slightly offset by expected additional revenue arising from past TCV sales in FY ’24. Consistent with our philosophy in driving profitable growth, we expect FY ’25 operating profit to be $532 million, and operating margin to be 17%. Margin for FY ’25 is in line with our longer-term goal of expanding operating margin by a percentage point or 2 each year and represents a 2-point increase from our FY ’24 guide that we communicated at the beginning of the year.\"Read the full earnings call transcript here.6. Cummins Inc (NYSE:CMI)Number of Hedge Fund Investors: 39Generators and power systems company Cummins Inc (NYSE:CMI) is one of the stocks Jim Cramer is highly bullish on. Recently, a questioner asked Jim Cramer during his program whether he should sell Cummins Inc (NYSE:CMI) to buy another stock. Cramer said, “ I forbid you to sell Cummins.” Cramer said that Jennifer Rumsey (Cummins' CEO) is doing “such a fabulous job.” In addition to CMI, Cramer also likes Apple Inc. (NASDAQ:AAPL), Amazon.com Inc. (NASDAQ:AMZN) and Alphabet Inc. (NASDAQ:GOOG). Click to continue reading and see Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 5 Stocks. Suggested Articles:Disclosure. None. Jim Cramer Says You Should ‘Buy, Buy, Buy’ These 11 Stocks is originally published on Insider Monkey."
    },
    {
        "Headline": "14 Best Stocks To Buy According to AI",
        "Content": "In this article, we will take a detailed look at the 14 Best Stocks To Buy According to AI. For a quick overview of such stocks, read our article 5 Best Stocks To Buy According to AI.When the generative AI boom started, investing circles brushed aside the possibility of AI picking stocks for humans to maximize returns. It’s too complex and subjective a job for any AI model, they said. Fast forward a few months, more and more investment experts and firms are deploying AI for stock picking. Bloomberg in February reported that Vanguard Group was using AI in several of its products that use quant investing techniques. Among the funds where Vanguard has deployed machine learning models include the Vanguard Strategic Equity Fund, the Vanguard Strategic Small-Cap Equity Fund and the Vanguard Market Neutral Fund. The Bloomberg report said that the Vanguard Strategic Equity Fund and the Strategic Small-Cap Fund beat their benchmarks and outperformed industry peers last year.Machine learning and algorithms have long been at play in the investing game for quant funds. But the generative AI boom is making the power of mathematical, AI-powered analysis available for everyone. Using AI in investing would no longer be limited to quant funds. Financial services company Mercer conducted a survey to find out the penetration of AI among investment managers across its Global Investment Manager Database. Nine out of 10 surveyed managers said they are already using or planning to use AI in their investment process. A whopping 54% of the investment managers said they are already using AI to assist their decision making, while 37% plan to use the technology in the near future.Mercer said in its report that the investment managers it surveyed said that the use of AI would give a whopping $14 trillion boost to the global economy by 2030.Since generative AI and machine learning in investing is currently in its early stages, there are some challenges for investment managers who are trying to use the technology to their advantage. Data quality and data availability are among the biggest challenges these managers are facing.Story continuesHumans VS Robots in the Stock-Picking GameBut robots are not taking over the investing game (for now). Almost no one in the survey said they are completely outsourcing the investing-related decision-making to AI. They are using AI-powered models just for assistance, idea generation, data analysis and other important tasks in the investing process. Final decision-making still rests with humans. The report added:“Just a small minority of managers report fully automated statistical, ML and DL models, reinforcing AI and ML technologies as tools that support managers, rather than replacing the role of manager judgment and intervention. Among managers currently using AI, around one in 10 report full automation of statistical models (11%), ML (14%) and DL models (6%), while a third report infrequent monitoring of these processes (33%, 32% and 33%, respectively). Across all three areas, a significant proportion of current AI processes remain reliant on constant human intervention, reinforcing the role of AI and ML technologies as a supportive “tool” rather than a direct replacement of humans across the investment process.”Best Stocks To Buy According to AIMethodologyThis article is a performance evaluation of the stocks recommended by ChatGPT last year. We wanted to see whether ChatGPT is any good at stock picking. For that we reverted to our experiment with ChatGPT conducted in March 2023 where we asked ChatGPT to recommend some stocks that would make one rich over the next 10 years. We also consulted Finder.com’s experiment with AI in which researchers at the comparison website asked ChatGPT to create a “portfolio of stocks from high-quality businesses with criteria taken from the leading 10 funds it is competing against.” This portfolio was also created back in March 2023.  In this article we picked 14 stocks from these two ChatGPT-recommended portfolios with the highest number of hedge fund investors. With each stock we mentioned its performance since the date it was picked up by ChatGPT. The idea is to assess the performance of ChatGPT when it comes to stock picking.ChatGPT Stock Picks: Performance Overview After One Year14. Johnson & Johnson (NYSE:JNJ)Stock Performance Since ChatGPT Recommended The Stock Last Year: Almost flatJohnson & Johnson (NYSE:JNJ) was also among the stocks recommended by ChatGPT to finder.com during the website’s experiment last year. Since the AI model’s recommendation till date the stock price has remained almost flat.As of the end of the fourth quarter of 2023, 81 hedge funds had stakes in Johnson & Johnson (NYSE:JNJ).ClearBridge Large Cap Value Strategy made the following comment about Johnson & Johnson (NYSE:JNJ) in its Q3 2023 investor letter:“The health care space provided some opportunities in the quarter, as we increased our exposure to medical device company Becton, Dickinson as well as large cap pharmaceutical company Johnson & Johnson (NYSE:JNJ). Johnson & Johnson recently spun out its consumer health care business, becoming a more focused yet broadly diversified pharmaceutical and medtech company.”13. Tesla Inc (NASDAQ:TSLA)Stock Performance Since ChatGPT Recommended The Stock Last Year: +6%Benzinga asked ChatGPT to make a stock portfolio to beat the leading equity funds in the US backed in May 2023. Tesla Inc (NASDAQ:TSLA) was one of the stocks recommended by ChatGPT at the time. Since then through March 27, 2024, Tesla Inc (NASDAQ:TSLA) shares have gained just 6% as Tesla Inc (NASDAQ:TSLA) continues to battle growth issues amid a slowdown in EV demand.Alger Spectra Fund stated the following regarding Tesla, Inc. (NASDAQ:TSLA) in its fourth quarter 2023 investor letter:“Tesla, Inc. (NASDAQ:TSLA) is an electric vehicle manufacturer with a significant technological lead in its large and rapidly growing addressable market. Tesla is a transportation company that is setting the pace for industry innovation, in our view. During the quarter, the company reported weaker-than-expected fiscal third quarter earnings, where gross margins were negatively impacted by factory downtime and ramping production volumes at new manufacturing plants. However, the company noted that they remain confident by the amount of data that Tesla’s established and growing fleet of vehicles has gathered, which may bode well for the company’s full self-driving capabilities.”12. Apple Inc (NASDAQ:AAPL)Stock Performance Since ChatGPT Recommended The Stock Last Year: +11%Apple Inc (NASDAQ:AAPL) shares have gained about 11% since March 16, 2023, when ChatGPT recommended the stock to Insider Monkey’s researchers when they asked the chatbot to suggest stocks that have the potential to make one rich. Apple Inc (NASDAQ:AAPL) has been late to the AI game and perhaps that’s why its stock gains aren’t that impressive. Apple Inc's (NASDAQ:AAPL) business in China is also facing challenges. Analysts expect Apple Inc (NASDAQ:AAPL) to reveal its AI projects in the upcoming developer conference scheduled for June.Orbis Global Equity Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter:“Never before has following the crowd made so much money. Nor, in our estimation, so little sense. But just look at the opportunities the crowd has left for those of us willing to take a different view. We could wax lyrical about the glaring difference in value between Korean banks priced at 4 times earnings, versus Apple Inc. (NASDAQ:AAPL) at 28 times, despite diverging fundamentals—Apple is increasingly at risk of bans in China, while Korean banks could double their dividends.”11. Procter & Gamble Co (NYSE:PG)Stock Performance Since ChatGPT Recommended The Stock Last Year: +14%Procter & Gamble Co (NYSE:PG) is one of the stocks recommended by ChatGPT last year when Insider Monkey asked the AI technology to make a portfolio of stocks that would make one rich in the next decade. Since the recommendation date until today, the stock price has gained about 14%.Madison Sustainable Equity Fund stated the following regarding The Procter & Gamble Company (NYSE:PG) in its fourth quarter 2023 investor letter:“We sold The Procter & Gamble Company (NYSE:PG). After two years of strong pricing growth, the company is facing slower market growth in both the US and Europe. China, the company’s second largest individual market, is facing a protracted downturn with poor visibility on when fundamentals will improve.”10. Visa Inc (NYSE:V)Stock Performance Since ChatGPT Recommended The Stock Last Year: +28%On March 16, 2023, when ChatGPT recommended Visa Inc (NYSE:V) to Insider Monkey, Visa Inc (NYSE:V) shares were trading at around $223, while the stock price sits at $279 today. This shows a 28% gain in stock price.As of the end of the fourth quarter of 2023, 162 hedge funds tracked by Insider Monkey had stakes in Visa Inc (NYSE:V).In its October 2023 investor letter, Lakehouse Capital stated the following regarding Visa Inc. (NYSE:V):“Visa Inc. (NYSE:V) reported a strong result with net revenue increasing 11% year-on-year to $8.6 billion and non-GAAP earnings per share increasing by 21% to $2.33. As has been the case for many years now, the scalable nature of the business allows for revenue growth to outpace its costs, which places the company in a good position to navigate through this inflationary period. The network continues to grow, with credentials and merchant locations up 7% and 17%, respectively. Cross-border travel-related spend also maintained its robust growth, increasing 26% year-on-year while Visa Direct reported 7.5 billion transactions, up 19% yearon-year, progressing on penetrating categories such as cross-border remittances. Altogether, we’re pleased with how the business is tracking and remain positive on Visa’s outlook.”9. Walmart Inc (NYSE:WMT)Stock Performance Since ChatGPT Recommended The Stock Last Year: +29%When finder.com asked ChatGPT to make a market-beating stock portfolio back in March 2023, the LLM included Walmart Inc (NYSE:WMT) in the list of its stock recommendations. Since March 6, 2023, through date Walmart Inc (NYSE:WMT) shares have gained about 29%.8. Berkshire Hathaway Inc Class B (NYSE:BRK.B)Stock Performance Since ChatGPT Recommended The Stock Last Year: +42%Insider Monkey asked ChatGPT in March 2023 to make a stock portfolio that'd make one rich in the next ten years. Berkshire Hathaway Inc Class B (NYSE:BRK.B) was part of the stocks recommended by the large language model. It proved to be one of the best stocks to buy according to AI because since March 16, 2023, the stock has gained about 42%.7. Adobe Inc (NASDAQ:ADBE)Stock Performance Since ChatGPT Recommended The Stock Last Year: +53%Adobe Inc (NASDAQ:ADBE) was one of the stocks recommended by ChatGPT to finder.com when the website asked the chatbot in March 2023 to make a portfolio. Since then through March 27, 2024, Adobe Inc (NASDAQ:ADBE) shares have gained about 53%. Adobe announced a host of new AI-related products at its annual Summit event recently.Here is what Polen Global Growth has to say about Adobe Inc. (NASDAQ:ADBE) in its Q3 2023 investor letter:“Both Alphabet and Adobe’s businesses continue to perform well. With respect to Adobe, the most recent quarter delivered more of the same with constant currency revenue growing 13%, margin expansion, and over 2% of shares outstanding repurchased for non-GAAP earnings growth of over 20%. We believe its approach to GenAI through Firefly, which guarantees safe content because it trains on Adobe Stock, will continue to be attractive to enterprises. The counter to GenAI, and something we are keeping an eye on with Alphabet and Adobe, is that it requires heavy investment. While both businesses can leverage their scale and manage costs in other areas, we expect the investment in future growth through GenAI will weigh on company-wide margins over the near term.”6. Alphabet Inc Class C (NASDAQ:GOOG)Stock Performance Since ChatGPT Recommended The Stock Last Year: +65%Alphabet Inc Class C (NASDAQ:GOOG) is one of the best stocks to buy according to AI. Alphabet Inc Class C (NASDAQ:GOOG) was recommended by ChatGPT to Insider Monkey when our researchers asked the chatbot to make a market-beating portfolio back in March 2023. Since then through March 27, 2024, Alphabet Inc Class C (NASDAQ:GOOG) shares have gained about 65% in value.Wedbush Securities recently added Alphabet Inc Class C (NASDAQ:GOOG) to its Best Ideas list and said the “perceived” risks to Google Search are overblown and Alphabet Inc Class C (NASDAQ:GOOG) remains a “net beneficiary” of generative AI.Pershing Square Holdings stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its fourth quarter 2023 investor letter:“In early 2023, we initiated an investment in Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, at a highly attractive valuation during a period when apprehension about the company’s competitive positioning in AI overshadowed the high-quality nature of its business and strong growth prospects.Since we initiated our position, the company has delivered impressive operating results. With two of the highest ROI and most resilient ad formats in Search and YouTube, Google occupies a dominant position in the secularly fast-growing digital advertising market. As the digital advertising market recovered over the course of the year, revenue growth in Google’s advertising business accelerated from 3% in Q1 2023 to 10% in Q4 2023. Moreover, the company realized significant progress on its substantial margin expansion opportunity and maintained a robust capital return program. In 2023, operating profit margins expanded by approximately 225 basis points (bps), excluding one-time severance and real estate charges, as the Cloud segment reached breakeven profitability. We expect continued cost control, automation efficiencies, and operating leverage in under-earning segments (Cloud & YouTube) to sustain margin expansion as Google invests behind AI initiatives.The company is using its ample free cash flow to repurchase approximately 4% of its outstanding shares on an annual basis…” (Click here to read the full text) Click to continue reading and see 5 Best Stocks To Buy According to AI. Suggested Articles:Disclosure. None. 14 Best Stocks To Buy According to AI was initially published on Insider Monkey."
    },
    {
        "Headline": "Are the \"Magnificent Seven\" Too Expensive to Buy?",
        "Content": "The \"Magnificent Seven\" has driven most of the stock market gains since the beginning of 2023, but each stock is starting to show cracks in its armor. Some of them have gotten far too extended and trade for unreasonable valuations despite the success in their underlying businesses. But are all of them overvalued?Let's examine this group and see if any could be considered cheap or if you'll need to pay a hefty premium to own these seven stocks.The Magnificent Seven aren't all dominating as they did in 2023The Magnificent Seven is made up of the following companies:Microsoft (NASDAQ: MSFT)Apple (NASDAQ: AAPL)Nvidia (NASDAQ: NVDA)Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL)Amazon (NASDAQ: AMZN)Meta Platforms (NASDAQ: META)Tesla (NASDAQ: TSLA)2023 was a phenomenal year for this cohort, with the worst-performing stock (Apple) returning nearly 50%. However, 2024 hasn't been so kind, and each stock's performance has been all over the place.MSFT data by YCharts.Part of this dichotomy has been valuation, as investors aren't willing to pay up to own some of the stocks in the Magnificent Seven.Because the Magnificent Seven are mostly considered growth companies, I'll use their revenue growth combined with their forward price-to-earnings (P/E) ratio to assess their valuation; I believe these two metrics show a wider picture. Cost reduction measures can prop up earnings, but those can only grow earnings for so long without any top-line growth.Tesla has had the worst year, losing nearly a third of its value this year. Its declining market value can be attributed to slowing growth in electric vehicle (EV) sales and shrinking margins due to rising competition. The really high premium that investors were willing to pay for the stock tumbled, and now the stock trades for 55 times forward earnings.Apple is in a similar situation, but its problems have occurred for much longer. Throughout 2023, Apple's quarterly revenue either shrank or grew at a 2% pace on a year-on-year basis. That's not great for a company valued like a growth stock, so it is no surprise that investors aren't willing to pay as much of a premium. Even at its current 26 times forward earnings, the stock still looks pricey for its growth.Story continuesBesides these two, the rest are up in 2024, but that doesn't mean they are all overpriced.The remaining five have varying situationsAlphabet and Meta Platforms come to the top of the list for stocks that I believe aren't overpriced. Alphabet, Google's parent company, has had some public relations issues related to the rollout of its generative AI model. However, Alphabet's ad business is still doing well, and with the company trading at 22 times forward earnings, it's the cheapest on the list.Meta isn't much more expensive, with the stock trading at 25.5 times forward earnings. Since its primary business is advertising (through its various social media platforms), it's benefiting from the same ad recovery wave as Alphabet. As a result, it's primed to continue growing for some time.Nvidia isn't as expensive as some may expect, as its vast growth hasn't concluded yet. At 38 times forward earnings, it's quite pricey, but with Nvidia being at the center of the AI revolution with its best-in-class graphics processing units (GPUs), it's to be expected.Amazon is more difficult to assess. It's still optimizing its business for profits, so its forward earnings multiple is skewed and will likely remain that way for some time. At 42 times earnings, it's the second-most expensive on the list. However, with Amazon's rising gross profit margin, it will only be a matter of time before its profits rocket higher and its valuation looks more reasonable.AMZN Gross Profit Margin (Quarterly) data by YCharts.Lastly, Microsoft is one of the most expensive stocks on this list despite being the largest company in the world by market capitalization. Microsoft's valuation is an incredibly pricey 37 times forward earnings -- nearly as expensive as Nvidia's despite far less growth. It earned this premium through fantastic AI product rollout and increased cloud computing market share. However, 37 times earnings is a lot for a company growing at 18% that appears to be fully optimized for profits.So, with all that information, how do these stocks rank from cheapest to most expensive?Valuation rankingsRanking the stocks by their forward price-to-earnings (P/E) multiple alone doesn't tell the full picture, as companies like Apple are struggling to grow while Nvidia is tripling its revenue. These rankings won't solely be based on metrics; they'll also include a nod to current growth and future opportunities.With that in mind, here are my rankings of the Magnificent Seven from the cheapest to most expensive:AlphabetMeta PlatformsAmazonNvidiaTeslaMicrosoftAppleRanking Alphabet and Meta as the cheapest was a no-brainer, but I'm also convinced that Amazon and Nvidia have more room to grow, making their expensive valuations seem cheaper in the grand scheme of things. Tesla is hard to figure out, but if EV demand continues to rise, this may be a bargain price. Lastly, Microsoft and Apple are very expensive for their growth, with Apple being the worst offender because it's hardly growing.Although this is my ranking, investors should decide for themselves whether any of these stocks are \"cheap\" enough to buy.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Keithen Drury has positions in Alphabet, Amazon, Meta Platforms, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Are the \"Magnificent Seven\" Too Expensive to Buy? was originally published by The Motley Fool"
    },
    {
        "Headline": "The \"Magnificent Seven\" Stocks, Ranked From Best to Worst Performance Over Time",
        "Content": "The S&P 500 roared higher over the past year or so from its bear market low to a new all-time high -- and this movement confirmed the market has indeed shifted into bull territory. The gains weren't exactly broad-based though. Stocks dubbed the \"Magnificent Seven\" -- a reference to the 1960 Western -- drove gains as they soared in the double or triple digits last year.Of course, that's just a short-term increase. But these stocks have proven themselves over a longer period too. Let's take a look at the performance of each of these players over the past five years and see if they still represent compelling buy stories. Here they are, ranked from best to worst, according to performance.Image source: Getty Images.1. Nvidia, up 1,950%Nvidia's (NASDAQ: NVDA) earnings and share price growth truly took off thanks to its crucial role in the development of artificial intelligence (AI). The company's graphics processing units (GPUs) used to be best known for their role in gaming -- but the ability to rapidly process many tasks simultaneously made Nvidia's GPUs a perfect fit for AI.Today, Nvidia holds about 80% of the AI chip market, and that's not likely to change as the company invests heavily to stay ahead of rivals. This tech giant just recently announced its new Blackwell architecture and most powerful chips ever, set for release later this year.2. Tesla, up 881%Tesla's (NASDAQ: TSLA) earnings and share price performance actually have slowed in recent times as various factors weigh on the electric vehicle giant -- from higher costs linked to production ramp-ups to negative foreign exchange impact.But Tesla surged over the past five years as the company delivered more and more vehicles, opened major new factories, delivered record earnings, and built up more than $29 billion in cash. The cash level is particularly important because it will help this ambitious EV leader continue to innovate and potentially progress on programs such as self-driving technology.Story continuesSo, Tesla's slowdown looks like a temporary situation, meaning growth probably isn't over for this market giant.3. Apple, up 268%Apple's (NASDAQ: AAPL) brand strength has helped it keep users coming back to world-famous products like the iPhone and Mac -- and even continue to attract new customers. This has made Apple the go-to stock for the technology investor seeking growth and safety. The company even won over billionaire investor Warren Buffett, who has almost half of his portfolio invested in the tech giant.Some may worry that Apple's growth could plateau at a certain point, but one particular thing makes me confident that won't happen. The company's services -- sold to its growing user base -- have taken off, with services revenue reaching records. And this could drive a whole new era of growth for Apple.4. Microsoft, up 260%Microsoft (NASDAQ: MSFT), like Apple, is a classic tech company that's proven its strength over the long haul. But in recent times, Microsoft also has shown its ability to seize a growth opportunity. The company was an early believer in AI, investing $1 billion in OpenAI, the developer of chatbot ChatGPT, back in 2019.The tech powerhouse later extended the partnership and increased its investment, a move that also strengthened the company's cloud business, Azure. This business offers a wide variety of AI tools and has seen its revenue growth soar, rising 30% in the most recent period -- surpassing that of rivals Amazon Web Services (AWS) and Google Cloud. Their revenue advanced 13% and 26%, respectively.So, Microsoft clearly could be a winner in the potential AI revolution.5. Meta Platforms, up 197%Meta Platforms (NASDAQ: META) went through a period of cost cutting in recent times, but at the same time, CEO Mark Zuckerberg planned for the next step for this social media giant. And that's building up strengths in AI. The company has gone all in on that, developing its own large language model and aiming to apply AI across its products and services.On top of that, Meta's dominance in social media is unwavering, a key point since it, through advertising, brings in most of the company's revenue. It's easy to imagine AI further boosting the company's social media platforms and driving more growth.6. Alphabet, up 159%Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has an extremely solid moat, or competitive advantage, in the business that brings in the lion's share of its revenue. And that's Google Search, which holds more than 90% of the global search market. This has kept advertisers coming back, even during recent times of higher inflation.Today, Alphabet, like many of these Magnificent Seven companies, is investing in AI, and this technology is helping it to make search faster and better. This, along with AI offerings through Google Cloud, may power earnings growth in the coming years.7. Amazon, up 103%Amazon (NASDAQ: AMZN) climbed during the early days of the pandemic as customers flocked to e-commerce -- but a couple of years later, higher inflation weighed on Amazon's costs and the wallets of its customers. And that hurt stock performance, making Amazon the worst-performing of the Magnificent Seven over the past five years (though a 100% gain isn't something to frown about).But the company revamped its cost structure and shifted from an annual loss in 2022 to solid profit in 2023, and the shares went on to gain. And this may continue thanks to Amazon's focus on AI. Amazon is using AI to improve its own operations and selling AI products and services through AWS, the world's cloud services leader.Are the Magnificent Seven stocks buys today?Now, let's get back to our question: Do these high-flying stocks still represent compelling buys? As you can see in the chart, they remain reasonably priced in relation to forward earnings estimates if you consider the long-term growth prospects of each of these players.AMZN PE Ratio (Forward) ChartTesla is the most expensive by this measure, but these figures consider potential earnings next year -- which is rather short term. The EV giant's moves today to lower the costs of producing its vehicles and incorporate AI in its processes could pay off over the coming years, making today's valuation look fair. Still, other players like Alphabet or Meta clearly are cheap and may represent an even better buying opportunity right now.And here's one important thing to note: Some of these companies went through rough patches in recent times, yet they still managed to deliver big gains over a five-year period. This is a great example of the power of long-term investing, which implies holding on to a stock for at least five years.All of this means it's not too late to get in on some or all of the Magnificent Seven, a group of quality stocks that could continue to deliver top returns over the long haul.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Adria Cimino has positions in Amazon and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.The \"Magnificent Seven\" Stocks, Ranked From Best to Worst Performance Over Time was originally published by The Motley Fool"
    }
]