[
    {
        "Headline": "AMD Stock Is Down 15% From Its 52-Week Highs, and Here's Why You Should Buy It",
        "Content": "Advanced Micro Devices (NASDAQ: AMD) stock price hit a 52-week high on March 8, but shares of the chipmaker have pulled back more than 15% since then, even though there has been no notable company-specific development in the interim.Of course, reports that China is reportedly planning to replace chips made by AMD and Intel from Chinese government servers and personal computers (PCs) did weigh briefly on the stock price, but even that shouldn't be a big problem for AMD in the long run. Here's why.Sanctions in China shouldn't be much of a trouble for AMDAMD reportedly gets 15% of its total revenue from selling its chips to China. So, any sanctions on sales of its chips in that country may have an impact on AMD's financials. However, the dynamics of the semiconductor market are such that even if AMD is unable to sell its chips in China, it will have other avenues to sell them.For instance, sales of both servers and PCs are expected to grow strongly across the globe thanks to the adoption of artificial intelligence (AI). Sales of PCs fell just 2.7% year over year in the fourth quarter of 2023 as compared to the 14% drop for the entire year. The market is set to witness a turnaround in 2024, driven by a new refresh cycle in the enterprise and education markets, as well as the arrival of AI-enabled PCs.Market research firm Canalys estimates that 48 million AI PCs could be shipped this year, accounting for 18% of the overall market. What's more, shipments of AI PCs could grow at an annual rate of 44% through 2028 and account for 70% of the overall market. Canalys also points out that AI PCs are likely to command a 10% to 15% premium as compared to traditional machines.AMD, therefore, has an opportunity to boost both its volumes and average selling price (ASP) of central processing units (CPUs). It is also worth noting that AMD has been taking share from Intel in the PC market. The company controlled 20.2% of the client CPU market in the fourth quarter of 2023, up from 17.1% in the year-ago period, as per Mercury Research.Story continuesMercury Research attributed the share gains to AMD's early move into the market for AI PCs with its Ryzen 7040 processor. Meanwhile, AMD claims that its CPUs are powering over 90% of AI PCs currently in the market. So, the stronger demand for AI PCs is going to give AMD's client processor business a nice shot in the arm.Something similar is likely to unfold in the server CPU and GPU (graphics processing unit) markets. AMD finished 2023 with 23% of the server CPU market under its control, up from 17.6% in the year-ago period. AMD CEO Lisa Su remarked on the latest earnings conference call that the company is witnessing \"robust demand for EPYC server CPUs across cloud, enterprise, and AI customers.\"AMD also added that \"a growing number of customers are adopting EPYC CPUs for inferencing workloads.\" The good part is that AMD's server CPU momentum is here to stay, as the market for AI servers is predicted to clock 26% annual growth through 2029. On the other hand, AMD saw stronger-than-expected demand for its AI GPUs as well.AMD increased its full-year revenue forecast from data center GPUs to $3.5 billion from the earlier estimate of $2 billion. However, management made it clear on the earnings call that it could very well exceed that mark because of an improving supply chain that will help it meet additional demand. All this indicates that AMD is well-placed to trump analysts' expectations in the coming quarters.AMD could surprise investors with stronger-than-expected growthWhen AMD released fourth-quarter 2023 results on Jan. 30, 2024, the company guided for $5.4 billion in revenue for the first quarter of 2024 at the midpoint. That would be nearly flat from the prior-year period's revenue of $5.35 billion. Additionally, AMD's non-GAAP (generally accepted accounting principles) gross margin guidance of 52% for the current quarter would be a slight improvement over the year-ago quarter's reading of 50%.AMD's revenue and earnings, therefore, could increase slightly in Q1. Analysts, however, expect AMD to post $5 billion in quarterly revenue, which is lower than what the company has guided for. Additionally, consensus estimates forecast a decline in AMD's earnings to $0.55 per share from $0.60 per share in the year-ago period.However, there is a solid chance that AMD could beat the market's expectations by a big margin because of the multiple AI-related tailwinds discussed above. The good part is that AMD's pullback has made the stock cheaper than before. This is evident from the chart:AMD PE Ratio (Forward) ChartAMD is now trading at 49 times forward earnings and has a price-to-sales ratio of less than 13. It was trading at more than 57 times forward earnings and 15 times sales earlier this month. Savvy investors can consider using this drop to accumulate AMD stock as the above-mentioned growth drivers could help it regain its mojo, and the turnaround could begin as soon as next month when it releases its first-quarter 2024 results.Should you invest $1,000 in Advanced Micro Devices right now?Before you buy stock in Advanced Micro Devices, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Harsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.AMD Stock Is Down 15% From Its 52-Week Highs, and Here's Why You Should Buy It was originally published by The Motley Fool"
    },
    {
        "Headline": "Should Intel and AMD Stock Investors Be Worried About Potential China Ban?",
        "Content": "In today's video, I discuss recent updates affecting Advanced Micro Devices (NASDAQ: AMD) and Intel (NASDAQ: INTC). Check out the short video to learn more, consider subscribing, and click the special offer link below.*Stock prices used were the after-market prices of March 27, 2024. The video was published on March 29, 2024.Should you invest $1,000 in Advanced Micro Devices right now?Before you buy stock in Advanced Micro Devices, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Jose Najarro has positions in Advanced Micro Devices. The Motley Fool has positions in and recommends Advanced Micro Devices. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy. Jose Najarro is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.Should Intel and AMD Stock Investors Be Worried About Potential China Ban? was originally published by The Motley Fool"
    },
    {
        "Headline": "Is Most-Watched Stock Intel Corporation (INTC) Worth Betting on Now?",
        "Content": "Intel (INTC) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.Over the past month, shares of this world's largest chipmaker have returned +2.6%, compared to the Zacks S&P 500 composite's +3.7% change. During this period, the Zacks Semiconductor - General industry, which Intel falls in, has gained 14.5%. The key question now is: What could be the stock's future direction?Although media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.Earnings Estimate RevisionsHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.Our analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.Intel is expected to post earnings of $0.13 per share for the current quarter, representing a year-over-year change of +425%. Over the last 30 days, the Zacks Consensus Estimate remained unchanged.The consensus earnings estimate of $1.32 for the current fiscal year indicates a year-over-year change of +25.7%. This estimate has changed -0.2% over the last 30 days.Story continuesFor the next fiscal year, the consensus earnings estimate of $2.06 indicates a change of +55.9% from what Intel is expected to report a year ago. Over the past month, the estimate has changed -0.2%.With an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Intel.The chart below shows the evolution of the company's forward 12-month consensus EPS estimate:12 Month EPSRevenue Growth ForecastWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.For Intel, the consensus sales estimate for the current quarter of $12.76 billion indicates a year-over-year change of +8.9%. For the current and next fiscal years, $57.77 billion and $63.82 billion estimates indicate +6.5% and +10.5% changes, respectively.Last Reported Results and Surprise HistoryIntel reported revenues of $15.41 billion in the last reported quarter, representing a year-over-year change of +9.7%. EPS of $0.54 for the same period compares with $0.10 a year ago.Compared to the Zacks Consensus Estimate of $15.14 billion, the reported revenues represent a surprise of +1.75%. The EPS surprise was +22.73%.The company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.ValuationWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.Comparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.The Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.Intel is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.ConclusionThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Intel. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free reportIntel Corporation (INTC) : Free Stock Analysis ReportTo read this article on Zacks.com click here.Zacks Investment Research"
    },
    {
        "Headline": "15 Best 5G Stocks To Buy According to Hedge Funds",
        "Content": "In this article, we will take a look at the 15 best 5G stocks to buy according to hedge funds. To see more such companies, go directly to the 5 Best 5G Stocks To Buy According to Hedge Funds.While artificial intelligence (AI) has been dominating headlines, another technological advancement is quietly gaining momentum and warrants investors' attention: 5G technology. Representing the next generation of mobile internet, 5G is poised to replace 4G, offering ultra-fast speeds and significantly lower latency, enhancing communication time between devices.Ericsson, a telecommunications company, stated in its mobility report that by 2028, 5G will emerge as the primary mobile access technology by subscription. Globally, 5G subscriptions are expected to surpass 5.3 billion in 2029, constituting 58% of all mobile subscriptions at that point. Further projections indicate that by 2029, North America and the GCC will boast the highest 5G penetration at 92%, followed closely by Western Europe at 85%.Of course, while the penetration of 5G connectivity is expected to open up new growth opportunities in both hardware and software sectors, a 2020 report by Edward Jones highlighted that the full realization of 5G may take considerable time due to the complexity of its technical infrastructure requirements. The report emphasized that the deployment of 5G would not reach completion levels until software developers conduct extensive testing and exploration to determine the most effective utilization of the high speeds and responsiveness unlocked by 5G technology. Consumer sentiment echoes this observation, with many 5G smartphone users indicating that their devices have yet to fully leverage the capabilities of the technology. Deloitte's research reveals that a significant majority (53%) of 5G smartphone users are actively looking for applications and experiences that can harness the advanced capabilities of the network. Additionally, a notable 26% expressed dissatisfaction with the absence of innovative apps and services specifically designed for the 5G environment.Story continuesHowever, investors should take note that despite the short-term headwinds in the 5G sector, such as those experienced by Nokia this past year, the economic benefits of the 5G revolution are expected to be far and wide. Grand View Research projects that the 5G services market will experience a compound annual growth rate (CAGR) of 59.4% from 2023 to 2030. This growth trajectory is anticipated to be driven b y the convergence of other sub-sectors of technology, including artificial intelligence, the Internet of Things (IoT), and high-speed data connectivity, which collectively will catalyze market expansion.Investors looking to capitalize on the potential of 5G should adopt a diversified strategy by investing in various sectors of the 5G ecosystem. This includes companies involved in providing 5G network equipment, tower infrastructure, semiconductors, hyperscalers, and mobile network operators. In that regard, some of the best 5G stocks to buy include the likes of Advanced Micro Devices, Inc. (NASDAQ:AMD), NVIDIA Corporation (NASDAQ:NVDA), and Amazon.com, Inc. (NASDAQ:AMZN).Best 5G Stocks To Buy According to Hedge FundsPhoto by Mario Caruso on UnsplashOur MethodologyIn this article, we've curated a list of the top 5G stocks based on hedge fund sentiment. While most of these stocks are primarily focused on 5G technology, some also include cloud service providers, holding companies with subsidiaries in the 5G sector, and semiconductor firms supporting 5G ecosystems. Our analysis is derived from Insider Monkey’s database of 933 elite hedge funds tracked as of the fourth quarter of 2023. The list is organized in ascending order based on the number of hedge fund holders in each company. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.15. Crown Castle Inc. (NYSE:CCI)Number of Hedge Fund Holders: 45Crown Castle Inc. (NYSE:CCI) is a notable presence in the real estate investment trust (REIT) sector, particularly within the 5G landscape, with an extensive portfolio boasting over 40,000 cell towers.On February 21, analysts at RBC Capital maintained a Sector Perform rating and a $109 price target on Crown Castle Inc. (NYSE:CCI).As of the end of Q4 2023, 45 hedge funds maintained stakes in Crown Castle Inc. (NYSE:CCI), consistent with the previous quarter, according to Insider Monkey’s database. These stakes collectively amount to nearly $1.6 billion.Much like Advanced Micro Devices, Inc. (NASDAQ:AMD), NVIDIA Corporation (NASDAQ:NVDA), and Amazon.com, Inc. (NASDAQ:AMZN), Crown Castle Inc. (NYSE:CCI) ranks as one of the best 5G stocks to invest in.14. Marvell Technology, Inc. (NASDAQ:MRVL)Number of Hedge Fund Holders: 53Marvell Technology, Inc. (NASDAQ:MRVL) has established itself as a frontrunner in the development of data processing units (DPUs), which play a crucial role in facilitating the movement of vast amounts of digital information within networking equipment and data centers. In an effort to expand its presence in key sectors such as 5G, cloud computing, and other business solutions, Marvell Technology, Inc. (NASDAQ:MRVL) made significant acquisitions in 2021, including Inphi and Innovium. These acquisitions bolstered Marvell's capabilities in areas such as fiber optics and network switching, complementing its existing DPU technology.We saw 53 hedge funds long Marvell Technology, Inc. (NASDAQ:MRVL) in the fourth quarter, with a total stake value of $1.8 billion.13. American Tower Corporation (NYSE:AMT)Number of Hedge Fund Holders: 56American Tower Corporation (NYSE:AMT) is a telecommunications and data center real estate investment trust (REIT) headquartered in Boston, Massachusetts. With approximately 221,000 properties worldwide, the company plays a crucial role in establishing fiber-optic networks that connect 5G small cell sites to the internet.On February 28, JPMorgan analysts maintained an Overweight rating and a $230 price target on American Tower Corporation (NYSE:AMT).As of the end of December 2023, 56 out of the 933 hedge funds covered by Insider Monkey’s research held shares of the company. The largest shareholder among these hedge funds is Charles Akre’s Akre Capital Management, owning 6.8 million shares valued at $1.4 billion.12. Cisco Systems, Inc. (NASDAQ:CSCO)Number of Hedge Fund Holders: 60Cisco Systems, Inc. (NASDAQ:CSCO) is a multinational corporation specializing in the design, manufacturing, and distribution of networking and communication products on a global scale. With a diverse product portfolio including switches, routers, wireless devices, and computing solutions, the company caters to various industries. Cisco Systems, Inc. (NASDAQ:CSCO) has also ventured into private 5G services, targeting sectors such as manufacturing, energy, and utilities. Its Meraki cloud wireless solution, featuring models like MG51 and MG51E, offers lower latency, enhanced security, and faster speeds.According to Insider Monkey's fourth-quarter database, 60 hedge funds expressed bullish sentiments towards Cisco Systems, Inc. (NASDAQ:CSCO), a slight decrease from 64 funds in the previous quarter. AQR Capital Management, under the leadership of Cliff Asness, holds the largest stake in the company, with 12 million shares valued at approximately $615 million.11. Verizon Communications Inc. (NYSE:VZ)Number of Hedge Fund Holders: 63Headquartered in New York, Verizon Communications Inc. (NYSE:VZ) is an integrated telecommunications services provider offering a wide range of communication, technology, information, and entertainment products and services. Through its operational divisions, the company delivers various services, including 5G and 4G wireless connectivity, high-speed internet, and digital TV across the United States.In the fourth quarter of the previous year, 63 out of the 933 hedge funds profiled by Insider Monkey had purchased and held shares of Verizon Communications Inc. (NYSE:VZ). Among these hedge funds, Arrowstreet Capital, led by Peter Rathjens, Bruce Clarke, and John Campbell, emerged as the largest investor with a stake valued at $948 million.Ariel Global Fund stated the following regarding Verizon Communications Inc. (NYSE:VZ) in its fourth quarter 2023 investor letter:“Global communications and technology leader, Verizon Communications Inc. (NYSE:VZ) also traded higher in the period following solid earnings results, highlighted by postpaid consumer net additions and an upward revision to free cash flow guidance. From a competitive and financial standpoint, we view Verizon to be among one of the best positioned telecoms in the world. The company’s solid long-term fundamentals are underscored by its predictable, recurring revenue streams and ~7% dividend yield. At current levels, Verizon is trading near an all-time low valuation presenting a compelling total return story for patient investors.”10. AT&T Inc. (NYSE:T)Number of Hedge Fund Holders: 66AT&T Inc. (NYSE:T) a global leader of telecommunications and one of the best 5G stocks to invest in, offers a wide array of wireless communication services, device sales, and data solutions to various customer segments, including businesses, government entities, wholesale clients, and residential users.On February 1, J.P. Morgan upgraded its rating on AT&T Inc. (NYSE:T) citing expectations of sustained and long-term growth, particularly in the wireless and broadband segments. The primary catalyst for this growth is identified as AT&T Inc. (NYSE:T)'s broadband division, driven by its ongoing fiber buildout. Analyst Richard Choe of J.P. Morgan expressed optimism about the additional opportunities this expansion will create within existing markets. Consequently, Choe upgraded the rating on AT&T Inc. (NYSE:T) from Neutral to Overweight and raised the year-end price target to $21 from $18.As of the end of Q4 2023, 66 hedge funds in Insider Monkey’s database held stakes in AT&T Inc. (NYSE:T), growing from 52 in the previous quarter. The consolidated value of these stakes is nearly $3 billion.9. Charter Communications, Inc. (NASDAQ:CHTR)Number of Hedge Fund Holders: 69Headquartered in Stamford, Connecticut, Charter Communications, Inc. (NASDAQ:CHTR) is a leading provider of broadband connectivity and cable services, operating under the Spectrum brand. With a presence in 41 states, the company serves over 32 million customers, offering a comprehensive range of residential and business solutions, including Spectrum Internet®, TV, Mobile, and Voice.According to Insider Monkey's data for Q4 2023, Charter Communications, Inc. (NASDAQ:CHTR) shares were held by 69 out of the 933 hedge funds tracked. The total value of these holdings amounted to $5.3 billion. Harris Associates emerged as the largest shareholder, possessing 5.2 million shares valued at $2.0 billion.8. T-Mobile US, Inc. (NASDAQ:TMUS)Number of Hedge Fund Holders: 75T-Mobile US, Inc. (NYSE:TMUS), headquartered in Bellevue, Washington, is a leading provider of wireless telecommunication services. Renowned for its strides in the 5G domain, the company has established one of the largest and fastest 5G networks in the United States, positioning itself for sustained growth in the upcoming period.As of March 20, RBC Capital analysts maintain an Outperform rating on T-Mobile US, Inc. (NYSE:TMUS), accompanied by a price target of $184.According to Insider Monkey's Q4 2023 database, 75 hedge funds reported holdings in T-Mobile US, Inc. (NASDAQ:TMUS), down slightly from 79 in the preceding quarter. The combined value of these holdings exceeds $3.8 billion.7. QUALCOMM Incorporated (NASDAQ:QCOM)Number of Hedge Fund Holders: 78QUALCOMM Incorporated (NASDAQ:QCOM) is a prominent developer and vendor of foundational technologies for the wireless industry, boasting a product portfolio that includes chips enabling 5G technology. The company has capitalized on the smartphone surge since the early 2000s by specializing in the technology behind 3G and 4G mobile networks. However, the advent of 5G is expanding the scope for the mobile chip designer, presenting opportunities in IoT devices and industrial equipment.On March 4, investment advisory firm Cantor Fitzgerald maintained a Neutral rating on QUALCOMM Incorporated (NASDAQ:QCOM) stock, setting a price target of $150.The number of hedge funds tracked by Insider Monkey holding stakes in QUALCOMM Incorporated (NASDAQ:QCOM) grew to 78 in Q4 2023, from 67 in the previous quarter. The consolidated value of these stakes is nearly $3 billion. With 3 million shares, Two Sigma Advisors was the company’s leading stakeholder in Q4.6. Intel Corporation (NASDAQ:INTC)Number of Hedge Fund Holders: 86Intel Corporation (NASDAQ:INTC), headquartered in Santa Clara, California, stands as a prominent American multinational corporation and technology company. Renowned for its leadership in semiconductor chip manufacturing based on revenue, Intel has played a pivotal role in advancing the x86 series of instruction sets, widely utilized in personal computers. Recently, Intel Corporation (NASDAQ:INTC) announced two significant updates aimed at enhancing footprint, power efficiency, and total cost of ownership (TCO) savings across 5G core networks: the preview of its Intel Xeon next-gen processors, code-named Sierra Forest, and the commercial availability of the Intel Infrastructure Power Manager (IPM) software for 5G core.According to Insider Monkey's fourth-quarter database, 86 hedge funds held long positions in Intel Corporation (NASDAQ:INTC), compared to 70 funds in the preceding quarter. William B. Gray’s Orbis Investment Management emerged as the largest stakeholder of the company, with 16 million shares valued at $801.35 million.In addition to Advanced Micro Devices, Inc. (NASDAQ:AMD), NVIDIA Corporation (NASDAQ:NVDA), and Amazon.com, Inc. (NASDAQ:AMZN), Intel Corporation (NASDAQ:INTC) is one of the best 5G stocks to invest in. Click to continue reading and see  Best 5G Stocks To Buy According to Hedge Funds. Suggested Articles:Disclosure. None. 15 Best 5G Stocks To Buy According to Hedge Funds is originally published on Insider Monkey."
    },
    {
        "Headline": "Forget SoundHound AI: 2 Artificial Intelligence (AI) Stocks to Buy Now and Hold for the Long Term",
        "Content": "Since artificial intelligence's (AI)  burst in popularity early last year, investors have been captivated by the potential for AI stocks to go parabolic. Take SoundHound AI for example. Since reports emerged in mid-February that Nvidia (NASDAQ: NVDA) owned a stake in the company, its stock has exploded higher, soaring as much as 295% in the weeks that followed.However, investors should be careful, as following the herd can be costly. SoundHound AI has fallen out of favor with at least one formerly bullish analyst and has been the target of a short report that raises several valid concerns. Furthermore, SoundHound AI sells for 18 times next year's sales and, despite its impressive growth, has yet to generate a profit.That's not to say this investment won't end up being a winner, but given the risky nature of this company, I would suggest investors forget SoundHound AI stock and look at these two AI leaders instead.Image source: Getty Images.1. NvidiaWhen it comes to AI, there's a compelling argument that no other company is better positioned to ride the AI wave than Nvidia itself. The company adapted its technology to accelerate AI models years ago and is the undisputed leader in powering machine learning algorithms, with an estimated 95% market share, according to New Street Research.As a result, Nvidia already had a wealth of experience when generative AI burst on the scene early last year. The company adapted its processors to provide the computational horsepower needed to run AI systems, and sales were off to the races.For its fiscal 2024 fourth quarter (ended Jan. 28), Nvidia delivered record revenue that surged 265% year over year to $22.1 billion, fueling adjusted earnings per share (EPS) that soared 486% to $5.16. This marked the third consecutive quarter of triple-digit year-over-year growth -- and it likely won't be the last. For the current quarter, management is forecasting record revenue of $24 billion, up 234% year over year.Story continuesThere are other reasons to believe Nvidia's growth spurt will continue. A great deal of AI processing and workloads take place in the cloud, and Nvidia has an edge there as well. The company has a market share estimated at 95% of the graphics processing units (GPUs) used in the data center space, according to CFRA equity analyst Angelo Zino.The buildout of data centers capable of AI processing has already begun. CEO Jensen Huang suggests that the spending necessary to bring data centers up to par will double to $2 trillion over the next several years.Nvidia isn't exactly cheap at 38 times forward earnings but has earned the premium thanks to its triple-digit growth.Rather than buy the stock that Nvidia bought, why not just buy Nvidia itself?2. Super Micro ComputerAnother company that's already reaping the benefits of the accelerating adoption of generative AI is Super Micro Computer (NASDAQ: SMCI), commonly referred to as Supermicro. The company also plays a big part in the processing of AI, developing the servers robust enough to handle the AI workload.The company partners with Nvidia, Advanced Micro Devices, and Intel, among others, to ensure its servers are optimized to work with their latest and most robust processors. Furthermore, these collaborations ensure that Supermicro has a steady supply of AI-centric chips to power its servers.For its fiscal 2024 second quarter (ended Dec. 31, 2023), Supermicro produced net sales of $3.66 billion, which surged 103% year over year, driving adjusted EPS of $5.59, up 71%. Management was clear that its record revenue was the result of strong demand for rack-scale systems used for AI.There are those who believe that Supermicro is taking share from its rivals. Barclays analyst George Wang posits that Supermicro \"has 7% market share globally, implying further share gains ahead are likely.\" He goes on to suggest that Supermicro is stealing share from Dell Technologies and Hewlett Packard Enterprise.Furthermore, the aforementioned data center upgrade cycle benefits Supermicro as well. Bernstein analyst Toni Sacconaghi has calculated that the AI server market will grow 75% annually over the next three years, calling the resulting buildout \"unprecedented.\"Supermicro's stock has surged, up 842% over the past year (as of this writing), yet is still remarkably cheap at less than 3 times next year's sales.Given its bargain-basement valuation and history of profits, Supermicro is a far better AI stock than SoundHound AI.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Danny Vena has positions in Nvidia and Super Micro Computer. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.Forget SoundHound AI: 2 Artificial Intelligence (AI) Stocks to Buy Now and Hold for the Long Term was originally published by The Motley Fool"
    },
    {
        "Headline": "Nvidia's Blackwell Chip Is Here. How Will the Red-Hot \"Magnificent Seven\" Company's New GPU Affect the Artificial Intelligence (AI) Landscape?",
        "Content": "Nvidia's (NASDAQ: NVDA) recent GPU Technology Conference (GTC) took the wraps off Blackwell -- the company's next-generation chip platform. Named after mathematician, statistician, and pioneering game theorist David Blackwell, the new graphics processing unit (GPU) hardware is designed to deliver unprecedented processing power for generative artificial intelligence (AI) applications.Made possible by a roughly $10 billion research and development budget, the first GB200 Blackwell processors are expected to deliver a major leap forward compared to the company's existing Hopper H100 GPUs. Nvidia expects to begin shipping the first generation of Blackwell chips later this year. A single GB200 GPU is expected to sell for somewhere between $30,000 and $40,000, and CEO Jensen Huang believes the new processor will quickly become the most successful product in the company's history.What does the upcoming release of Blackwell mean for Nvidia's stock? And how will this incredibly powerful new GPU reshape the AI landscape?Image source: Getty Images.Nvidia gears up to build an unbeatable AI ecosystemWith a market capitalization of roughly $2.4 trillion, Nvidia now ranks as the third-most valuable of the Magnificent Seven companies. The AI leader's stock soared 259% over the last year as skyrocketing demand for its GPUs powered incredible sales and earnings growth. Now, the company has a new processor on the horizon that looks poised to deliver incredible tech breakthroughs.Nvidia's GB200 is expected to be roughly four times as fast as its H100 GPUs, which are currently top of the line and favored for powering today's most advanced AI applications. Given the dramatic performance improvements delivered by the first generation of Blackwell chips, it's reasonable to expect that these new processors will pave the way for dramatic new advancements in AI technologies.Nvidia already said that Blackwell is being adopted by every major global cloud-services provider. It's also seeing strong demand from AI-focused companies, telecom providers, and a range of other technology businesses. Heralding the arrival of what looks to be another breakthrough moment for artificial intelligence, Blackwell's unveiling was paired with endorsements from Microsoft CEO Satya Nadella, Alphabet CEO Sundar Pichai, Amazon CEO Andy Jassy, OpenAI CEO Sam Altman, and other high-profile tech leaders and luminaries.Story continuesBut crucially, Blackwell is part of a much larger ecosystem strategy. Check out this quote from Nvidia's Jensen Huang:Blackwell is both a chip at the heart of the system, but it's really a platform. It's basically a computer system. What Nvidia does for a living is not build the chip. We build an entire supercomputer, from the chip to the system to the interconnects, the NVLinks, the networking, but very importantly the software.Nvidia will also be using its next-generation GPUs to advance its position and ambitions in the software space. Leading AI developers already rely on Nvidia's CUDA software to create applications that are powered by the company's processors, and the appeal of the high-performance Blackwell processors should help ensure that customers continue to use its software.The strategy extends even further. During a meeting at GTC, Huang had this to say: \"You can build chips to make software run better, but you can't create a new market without software. What makes us unique is that we're the only chip company I believe that will create its own market.\"With the release of the GB200, Nvidia appears to be on track to open the door for the creation of new categories of AI software applications. In turn, the launch, scaling, and continued evolution of such software could create even more demand for its ultrahigh-end GPUs.An alliance is forming to challenge Nvidia's AI dominanceReuters reported on March 25 that companies including Alphabet, Qualcomm, and Intel are teaming up to create an organization aimed at stopping Nvidia from establishing an unassailably dominant position in AI. The group's UXL Foundation is aiming to create a software suite that will help run AI applications on a wider range of processors and reduce reliance on Nvidia's platforms.According to the report, the UXL Foundation is now looking to recruit Microsoft, Amazon, and other influential technology players. So while many of the biggest names in tech are excited about Blackwell's capabilities, there's understandably resistance to the broader AI space becoming overly reliant on Nvidia's ecosystem.To some extent, the formation of the UXL Foundation speaks to just how strong Nvidia's competitive positioning is right now. The company commands roughly 90% of the market for the kinds of GPUs used for AI and other accelerated computing applications, and the launch of Blackwell will likely help it maintain or even expand its dominance. Paired with an expanding array of purpose-tailored software tools, Nvidia is on track to reshape the AI landscape -- and its competitors and potential rivals have a lot of catching up to do.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, Nvidia, and Qualcomm. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.Nvidia's Blackwell Chip Is Here. How Will the Red-Hot \"Magnificent Seven\" Company's New GPU Affect the Artificial Intelligence (AI) Landscape? was originally published by The Motley Fool"
    },
    {
        "Headline": "Intel Is at the Center of an Industrywide Push to End Nvidia's AI Dominance",
        "Content": "A big reason why Nvidia (NASDAQ: NVDA) is currently the overwhelming leader in the AI accelerator market is related to software. The company's CUDA software platform, which enables developers to write applications that tap into Nvidia's GPUs for accelerating workloads, has been widely used across academia and industry for nearly two decades. CUDA has become the de facto standard, and it only works with NVIDIA's products.When the AI boom kicked off in late 2022, Nvidia's GPUs and CUDA platform represented the path of least resistance. There are capable AI accelerators from competitors, including Intel (NASDAQ: INTC) and Advanced Micro Devices, and cloud giants like Alphabet are increasingly designing their own custom AI chips. However, the CUDA software platform effectively locks customers into using Nvidia's GPUs.An industrywide revoltIntel has been working on oneAPI, an open specification that's at the heart of the company's efforts to kick-start an alternative to CUDA, for the past few years. oneAPI is multi-architecture, meaning that a single code base can be used across CPUs, GPUs, and other types of chips, and multi-vendor, meaning it aims to support chips from any company. This is in stark contrast to CUDA, which is locked to Nvidia's GPUs.Intel is far from the only company eager to see Nvidia's AI accelerator dominance erode. In late 2023, Intel came together with Arm Holdings, Alphabet's Google, Qualcomm, Samsung, and a few others to form the Unified Acceleration (UXL) Foundation. The core goal of this union is to build an open software ecosystem for all accelerators. Intel's oneAPI is at the center of this effort.For companies like Google, which buys mountains of Nvidia's GPUs to power AI workloads for itself and its cloud customers, having alternatives to Nvidia could help cut down costs considerably. For companies like Qualcomm and Samsung, breaking CUDA's iron grip on the AI accelerator market makes it more likely that their own products will gain traction.Story continuesSamsung has concrete plans to enter the AI accelerator market in early 2025 with the launch of its Mach 1 chips. While Samsung's first effort will be focused on AI inference, not AI training, the software ecosystem will ultimately determine whether the chip is a success.Meanwhile, Qualcomm is focused on integrating AI into all of its chips, an effort that will require software support to pay off. \"We're actually showing developers how you migrate out from an Nvidia platform,\" said Qualcomm's head of AI and machine learning in an interview with Reuters.Intel may benefit most of allIntel is going after the AI market in multiple ways. The company sells its Gaudi line of AI accelerators, and it's been baking AI chips into its recent CPUs.While the industrywide effort to break CUDA's dominance will make Intel's products more attractive, it's the company's semiconductor foundry business that may benefit the most. Intel plans to overtake foundry leader TSMC technologically in early 2025 with its Intel 18A process, and it has aspirations to become the world's second-largest foundry by 2030. The more competitive the AI accelerator market is, and the more chips that have AI capabilities built-in, the more potential customers for Intel's foundry.While a more competitive AI chip market may hinder Intel's market share in AI accelerators, the company's foundry opportunity is enormous. Global foundry spending topped $100 billion in 2022, and it's expected to more than double to $231 billion by 2032. In the long run, Intel's foundry could be raking in tens of billions of dollars in revenue annually.It will take time for the anti-CUDA efforts to gain traction. UXL is aiming to get the specifications for its open alternative to a mature state by the end of the year, an eternity in the fast-moving world of AI. It will take even more time to get developers on board in numbers that are big enough to matter.But the reward for this effort will be a more competitive AI chip market. For Intel, a hoard of AI accelerators gunning for Nvidia's dominance could help supercharge the company's foundry business in the years ahead.Should you invest $1,000 in Intel right now?Before you buy stock in Intel, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Timothy Green has positions in Intel. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Nvidia, and Qualcomm. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.Intel Is at the Center of an Industrywide Push to End Nvidia's AI Dominance was originally published by The Motley Fool"
    },
    {
        "Headline": "2 Reasons to Buy Nvidia Stock Like There's No Tomorrow",
        "Content": "Nvidia (NASDAQ: NVDA) has been on top of the world over the last year as it has cornered the market on artificial intelligence (AI) chips, with its stock up more than 247% since last March.As demand for AI services soared, so has the need for graphics processing units (GPUs) -- the chips necessary for training and running AI models. Meanwhile, Nvidia has held a leading market share in GPUs for years, perfectly positioning it to immediately begin supplying its chips to AI developers everywhere.Consequently, Nvidia's earnings have skyrocketed as it achieved a majority market share in the AI GPU market while competitors like Advanced Micro Devices and Intel have scrambled to catch up.Nvidia's meteoric rise has some analysts questioning how much room the company has left to run. However, its stock keeps defying expectations, rising 20% in the last month alone. Given the massive potential of AI and Nvidia's position in the market, I wouldn't bet against it over the long term.So, here are two reasons to buy Nvidia stock like there's no tomorrow.1. Getting a head start in artificial intelligence (AI)The launch of OpenAI's ChatGPT in November 2022 reignited interest in AI and highlighted just how far the technology had come. Companies from countless industries began pivoting their businesses toward the budding arena as it became clear that AI could bolster a wide variety of businesses, from consumer tech to autonomous vehicles, e-commerce, cloud computing, and more.Data from Grand View Research shows the AI market hit close to $200 billion last year and is expected to expand at a compound annual growth rate of 37% until at least 2030. For reference, that projection would see the industry reach nearly $2 trillion by the end of the decade. As a result, there seems to be no end in sight to the soaring demand for AI GPUs.Meanwhile, last year, Nvidia's head start in the market saw it achieve an estimated 90% market share in AI chips, leading to soaring earnings.Story continuesIn its most recent quarter (the fourth quarter of fiscal 2024, which ended in January), the company's revenue increased by 265% year over year to $22 billion. Operating income jumped 983% to nearly $14 billion. This monster growth was primarily thanks to a 409% increase in data center revenue, reflecting a spike in AI GPU sales.Additionally, Nvidia's free cash flow is up 430% in the last year to more than $27 billion, significantly higher than AMD's $1 billion and Intel's negative $14 billion. So, despite new GPU releases from both competitors, Nvidia's head start in AI potentially pushed the company further ahead, providing it with more significant cash reserves to continue investing in technology and retain market supremacy.2. Nvidia's stock is trading at its best value in monthsLast year, Nvidia became the first chipmaker to achieve a market cap above $1 trillion. In fact, its market cap is currently more than $2 trillion, with Nvidia the world's third most valuable company, only after Microsoft and Apple.Nvidia has come a long way in a short time. Yet its stock has actually increased in value over the last 12 months.NVDA Price to Free Cash Flow ChartThe chart above shows that Nvidia's price-to-free-cash-flow and price-to-earnings ratios plunged in the last year, indicating its stock is at one of its best-valued positions in 12 months.P/E is calculated by dividing a company's stock price by its earnings per share. Meanwhile, the price-to-free-cash-flow ratio divides its market cap by free cash flow. These are helpful valuation metrics as they take into account a company's financial health. For both, the lower the figure, the better the value.This, in addition to Nvidia's potent position in a burgeoning industry and significant cash reserves, makes the company's stock worth considering right now for a long-term investment.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Microsoft, and Nvidia. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.2 Reasons to Buy Nvidia Stock Like There's No Tomorrow was originally published by The Motley Fool"
    }
]