[
    {
        "Headline": "Dow Jones Futures: Inflation Data 'Good,' Powell Says; Will Nvidia AI Chip Peer Forge A Base?",
        "Content": "The stock market impressed but Friday's inflation data was sticky. Nvidia peer and AI chip IPO Astera Labs could be starting a base.Continue reading"
    },
    {
        "Headline": "UPDATE 2-US Congress bans staff use of Microsoft's AI Copilot, Axios reports",
        "Content": "(Adds comment from Microsoft in paragraph 4; adds background in paragraph 6)March 29 (Reuters) - The U.S. House of Representatives has set a strict ban on congressional staffers' use of Microsoft's Copilot generative AI assistant, Axios reported on Friday.\"The Microsoft Copilot application has been deemed by the Office of Cybersecurity to be a risk to users due to the threat of leaking House data to non-House approved cloud services,\" the House's Chief Administrative Officer Catherine Szpindor said, according to the Axios report.\"We recognize that government users have higher security requirements for data. That’s why we announced a roadmap of Microsoft AI tools, like Copilot, that meet federal government security and compliance requirements that we intend to deliver later this year,” a Microsoft spokesperson told Reuters.The U.S. House's chief administrative office did not immediately respond to a Reuters request for comment.Policymakers have been looking at potential risks in federal agency adoption of artificial intelligence and the adequacy of safeguards to protect individual privacy and ensure fair treatment.Last year, two Democratic and two Republican U.S. senators introduced legislation to ban the use of artificial intelligence that creates content falsely depicting candidates in political advertisements to influence federal elections. (Reporting by Mrinmay Dey and Mehnaz Yasmin in Bengaluru; Editing by Daniel Wallis and Marguerita Choy and David Gregorio)"
    },
    {
        "Headline": "US Congress bans staff use of Microsoft's AI Copilot, Axios reports",
        "Content": "(Reuters) -The U.S. House of Representatives has set a strict ban on congressional staffers' use of Microsoft's Copilot generative AI assistant, Axios reported on Friday.\"The Microsoft Copilot application has been deemed by the Office of Cybersecurity to be a risk to users due to the threat of leaking House data to non-House approved cloud services,\" the House's Chief Administrative Officer Catherine Szpindor said, according to the Axios report.\"We recognize that government users have higher security requirements for data. That’s why we announced a roadmap of Microsoft AI tools, like Copilot, that meet federal government security and compliance requirements that we intend to deliver later this year,” a Microsoft spokesperson told Reuters.The U.S. House's chief administrative office did not immediately respond to a Reuters request for comment.Policymakers have been looking at potential risks in federal agency adoption of artificial intelligence and the adequacy of safeguards to protect individual privacy and ensure fair treatment.Last year, two Democratic and two Republican U.S. senators introduced legislation to ban the use of artificial intelligence that creates content falsely depicting candidates in political advertisements to influence federal elections.(Reporting by Mrinmay Dey and Mehnaz Yasmin in Bengaluru; Editing by Daniel Wallis and Marguerita Choy and David Gregorio)"
    },
    {
        "Headline": "Could Oracle Become the Next Microsoft?",
        "Content": "Microsoft's (NASDAQ: MSFT) stock surged nearly 1,000% over the past decade and turned it into the world's most valuable company, with a market cap of $3.2 trillion. That massive growth spurt was driven by the expansion of its mobile, cloud, and AI ecosystems under Satya Nadella, who became the company's CEO in 2014.Microsoft is still one of the market's top AI stocks, but investors are probably already looking for the next tech stock that could replicate those gains over the next decade. Could that company be Oracle (NYSE: ORCL), which is also gradually expanding its cloud and AI ecosystems but has a smaller market cap of $350 billion?Image source: Getty Images.The similarities and differencesMicrosoft and Oracle operate different business models. Microsoft is a more diversified company and generates most of its revenue from its Windows operating system, Office productivity software, Azure cloud-based infrastructure platform, and other cloud-based services. It also sells ads in its Bing search engine, PC hardware through its Surface division, and video game products through its Xbox division.Over the past decade, most of Microsoft's growth stemmed from Azure and the conversion of its Office products and Dynamics customer relationship management (CRM) platform into cloud-based services. Its investments in OpenAI also allowed it to integrate the start-up's generative AI tools into its own cloud-based ecosystem.Oracle is one of the world's top database software companies. It initially established an early mover's advantage with its on-premise applications, but Amazon and Microsoft pulled ahead with their own cloud-based database services. To keep pace with that shift, Oracle transformed its on-premise applications to cloud-based services and inorganically expanded its ecosystem with more enterprise resource planning (ERP), CRM, and healthcare IT management services. It also launched its own cloud platform, Oracle Cloud Infrastructure (OCI).Story continuesOracle now ranks third in the cloud-based database software market, behind Amazon and Microsoft, while OCI is still a tiny platform compared to Amazon Web Services (AWS), Microsoft Azure, and Alphabet's Google Cloud. It also ranks third in the CRM market behind Salesforce and Microsoft, and it remains a distant underdog in the fragmented ERP market. That's probably why Oracle isn't often mentioned in the same breath as Microsoft or Amazon.Oracle is still expanding its cloud and AI businessesOracle generated 38% of its revenue from its total cloud services in its latest quarter. By comparison, Microsoft generated 54% of its revenue from its cloud services last quarter.Oracle plans to keep expanding its cloud business to offset the slower growth of its on-premise, licensing, and support divisions. It expects the rising usage of its back office database and ERP applications, the growth of OCI, and a new AI infrastructure contract with Nvidia to drive that expansion and widen its moat.In its latest earnings report, CEO Safra Catz said Oracle expected to \"continue receiving large contracts reserving cloud infrastructure capacity because the demand for our Gen2 AI infrastructure substantially exceeds supply -- despite the fact we are opening new and expanding existing cloud datacenters very, very rapidly.\"But could Oracle replicate Microsoft's gains?In other words, Oracle should benefit from the expansion of the AI market, which Grand View Research expects to grow at a compound annual growth rate (CAGR) of 37% from 2023 to 2030. But a lot of those gains will still be offset by its slower-growing legacy businesses.From fiscal 2023 (which ended last May) to fiscal 2026, analysts expect Oracle's revenue to increase at a CAGR of 8% as its EPS rises at a CAGR of 22%. A large portion of that earnings growth will likely be driven by big buybacks. It already bought back 38% of its shares over the past 10 years, and it should maintain that tradition for the foreseeable future.Those growth rates are stable, but they probably won't turn Oracle into the next Microsoft. From fiscal 2013 to fiscal 2023 (which ended last June), Microsoft grew its revenue at a CAGR of 11% as its EPS rose at a CAGR of 14%. From fiscal 2023 to fiscal 2026, analysts expect its revenue and EPS to increase at a CAGR of 15% and 17%, respectively, as it continues to expand its cloud and AI ecosystems.Assuming Oracle matches analysts' expectations for the next three years, continues to grow its EPS at a CAGR of 20% from fiscal 2026 to fiscal 2033, and trades at 20 times earnings, its stock could more than triple to $400 a share and lift its market cap to about $1.1 trillion. That would be an impressive 10-year gain, but it wouldn't match Microsoft's massive rally over the past decade. It would also still be a lot smaller than today's Microsoft.So instead of wondering if Oracle will shake off its reputation as a dusty old tech stock and become the next Microsoft, investors should focus on its core strengths: it's successfully expanding its own cloud and AI businesses in the shadow of its larger competitors, it's returning plenty of cash to its shareholders, and its stock is still reasonably valued.Should you invest $1,000 in Oracle right now?Before you buy stock in Oracle, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Oracle wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, Nvidia, Oracle, and Salesforce. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Could Oracle Become the Next Microsoft? was originally published by The Motley Fool"
    },
    {
        "Headline": "UPDATE 3-Microsoft, OpenAI plan $100 billion data-center project, media report says",
        "Content": "(Add response from Microsoft, paragraph 12)March 29 (Reuters) - Microsoft and OpenAI are working on plans for a data center project that could cost as much as $100 billion and include an artificial intelligence supercomputer called \"Stargate\" set to launch in 2028, The Information reported on Friday.OpenAI did not immediately respond to Reuters' requests for comment.Rapid adoption of generative artificial intelligence technology has led to sky-rocketing demand for AI data centers capable of handling more advanced tasks than traditional data centers.The Information reported that Microsoft would likely finance the project, which is expected to be 100 times more costly than some of the biggest existing data centers, citing people involved in private conversations about the proposal.The proposed U.S.-based supercomputer would be the biggest in a series the companies are looking to build over the next six years, the report added.The Information attributed the tentative cost of $100 billion to a person who spoke to Altman about it and a person who has viewed some of Microsoft's initial cost estimates. It did not identify those sources.Altman and Microsoft have spread the supercomputers across five phases, with Stargate as the fifth phase. Microsoft is working on a smaller, fourth-phase supercomputer for OpenAI to be launched around 2026, according to the report.Microsoft and OpenAI are in the middle of the third phase of the five-phase plan, with a significant portion of the cost for the next two phases involving acquiring the needed AI chips, the report said.AI chips are often sold at high prices. Chip company Nvidia CEO Jensen Huang told CNBC earlier in March that the latest \"Blackwell\" B200 artificial intelligence chip will be priced between $30,000 and $40,000.Microsoft had also announced a duo of custom-designed computing chips in November last year.The report said the new project would be designed to work with chips from different suppliers.\"We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,\" a Microsoft spokesperson said in an emailed statement to Reuters. The spokesperson did not comment directly on the report about the planned launch of the Stargate supercomputer.Expenses for the plan could exceed $115 billion, more than triple Microsoft's expenditure last year on capital spending for servers, buildings and other equipment, the report stated. (Reporting by Arsheeya Bajwa in Bengaluru; Editing by Paul Simao and David Gregorio)"
    },
    {
        "Headline": "Microsoft-Backed Rubrik Is Ready to File Next Week for IPO",
        "Content": "(Bloomberg) -- Rubrik Inc., a cloud and data security startup backed by Microsoft Corp., is planning to file as soon as next week for an initial public offering, according to people familiar with the matter.Most Read from BloombergDetails of the company’s plans, including the timing, could still change, said the people, who asked not to be identified discussing confidential information. A spokesperson for Palo Alto, California-based Rubrik declined to comment.Rubrik is set to join other companies planning to go public after successes this month by social media platform Reddit Inc. and semiconductor connectivity company Astera Labs Inc., which met or exceeded their IPO fundraising goals and then rose in their trading debuts. Digital marketing software firm Ibotta Inc. and commodities trading platform Marex Group Plc are among the companies that have filed for IPOs in the past week.This year, 48 companies have raised about $9.6 billion via IPOs on US exchanges, according to data compiled by Bloomberg. That’s up from $3.8 billion by 46 companies in the first quarter of 2023.Rubrik had been working on its listing plans with Goldman Sachs Group Inc., Barclays Plc and Citigroup Inc. and could seek to raise $500 million to $700 million in an IPO, Bloomberg News reported in September.The company confidentially submitted its IPO plans to the US Securities and Exchange Commission earlier. In its upcoming public filing, Rubrik will disclose details of its finances and operations.Microsoft made an equity investment in Rubrik in 2021 in a financing round that valued the startup at $4 billion, according to data provider PitchBook. Rubrik, whose backers also include Bain Capital Ventures, Lightspeed Venture Partners, Greylock Partners and Khosla Ventures, has raised $1.18 billion to date, the PitchBook data shows.Story continues(Updates with IPO totals in fourth paragraph.)Most Read from Bloomberg Businessweek©2024 Bloomberg L.P."
    },
    {
        "Headline": "Microsoft, OpenAI plan $100 billion data-center project, media report says",
        "Content": "(Reuters) -Microsoft and OpenAI are working on plans for a data center project that could cost as much as $100 billion and include an artificial intelligence supercomputer called \"Stargate\" set to launch in 2028, The Information reported on Friday.OpenAI did not immediately respond to Reuters' requests for comment.Rapid adoption of generative artificial intelligence technology has led to sky-rocketing demand for AI data centers capable of handling more advanced tasks than traditional data centers.The Information reported that Microsoft would likely finance the project, which is expected to be 100 times more costly than some of the biggest existing data centers, citing people involved in private conversations about the proposal.The proposed U.S.-based supercomputer would be the biggest in a series the companies are looking to build over the next six years, the report added.The Information attributed the tentative cost of $100 billion to a person who spoke to Altman about it and a person who has viewed some of Microsoft's initial cost estimates. It did not identify those sources.Altman and Microsoft have spread the supercomputers across five phases, with Stargate as the fifth phase. Microsoft is working on a smaller, fourth-phase supercomputer for OpenAI to be launched around 2026, according to the report.Microsoft and OpenAI are in the middle of the third phase of the five-phase plan, with a significant portion of the cost for the next two phases involving acquiring the needed AI chips, the report said.AI chips are often sold at high prices. Chip company Nvidia CEO Jensen Huang told CNBC earlier in March that the latest \"Blackwell\" B200 artificial intelligence chip will be priced between $30,000 and $40,000.Microsoft had also announced a duo of custom-designed computing chips in November last year.The report said the new project would be designed to work with chips from different suppliers.\"We are always planning for the next generation of infrastructure innovations needed to continue pushing the frontier of AI capability,\" a Microsoft spokesperson said in an emailed statement to Reuters. The spokesperson did not comment directly on the report about the planned launch of the Stargate supercomputer.Expenses for the plan could exceed $115 billion, more than triple Microsoft's expenditure last year on capital spending for servers, buildings and other equipment, the report stated.(Reporting by Arsheeya Bajwa in Bengaluru; Editing by Paul Simao and David Gregorio)"
    },
    {
        "Headline": "Microsoft and OpenAI planning $100 billion data center project, the Information reports",
        "Content": "March 29 (Reuters) - Microsoft and OpenAI are planning a data center project that could cost as much as $100 billion, and will include an artificial intelligence supercomputer called \"Stargate\", the Information reported on Friday. (Reporting by Arsheeya Bajwa in Bengaluru)"
    }
]