[
    {
        "Headline": "Why MicroStrategy Stock Moved Higher Again This Week",
        "Content": "Shares of MicroStrategy stock (NASDAQ: MSTR) were rising yet again this week. The company that has staked its entire future on Bitcoin rose 11.9% this week, according to data from S&P Global Market Intelligence. With Bitcoin getting close to an all-time high, investors are making bets that the future of MicroStrategy is bright. The stock is up 500% in the past year.Here's why MicroStrategy's stock was up yet again this week.Using debt to buy BitcoinMicroStrategy pivoted in the last few years from a niche software business to using all its capital and taking on massive amounts of debt to purchase Bitcoin. That's its entire business strategy. And so far, this strategy has worked, as its shares are up 1,000% in the last five years, and its market cap is close to $30 billion. Earlier this month, it raised more convertible notes -- $600 million worth -- to increase its debt-fueled bet on Bitcoin.Investors in MicroStrategy are likely betting the company is a great way to get exposure to Bitcoin. But this logic may be flawed due to the stock's extreme premium to the actual Bitcoins it holds on its balance sheet. According to a recent short report from Kerrisdale Capital, MicroStrategy has recently traded at close to 2.5 times the actual value of the Bitcoins it holds, which makes little sense given the small size of the company's software subsidiary.The investment firm has decided to short MicroStrategy while simultaneously getting long Bitcoin in order to bet on this divergence. While retail investors should be hesitant about shorting any company, this is a clear example of how professional investors see MicroStrategy as overvalued.There are better ways to get exposure to BitcoinWith the launch of Bitcoin exchange-traded funds (ETFs), there are now much easier ways to get exposure to Bitcoin if you so desire. New ETFs have annual management fees of around 0.25%, which will barely eat into investment returns. It doesn't make sense for long-term, buy-and-hold investors to buy MicroStrategy to get exposure to Bitcoin if the actual Bitcoin on the balance sheet is worth a lot less.Story continuesMicroStrategy has done well in recent years. But it only has a small operating business and is truly just a bet on Bitcoin. When you can make a bet on Bitcoin at a significantly cheaper price by simply buying a different asset or investment vehicle like an ETF, why would anyone buy MicroStrategy at this price? It doesn't make sense. Stay far away from MicroStrategy for the time being. There are better ways to get exposure to Bitcoin.Should you invest $1,000 in MicroStrategy right now?Before you buy stock in MicroStrategy, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and MicroStrategy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Brett Schafer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.Why MicroStrategy Stock Moved Higher Again This Week was originally published by The Motley Fool"
    },
    {
        "Headline": "MicroStrategy Is Up 170% This Year. A Short Seller Says It’s Overvalued.",
        "Content": "Kerrisdale Capital said in a report Thursday it is long Bitcoin and short shares of MicroStrategy arguing MicroStrategy is “a proxy for bitcoin which trades at an unjustifiable premium to the digital asset that drives its value.” MicroStrategy’s stock tumbled 11% Thursday. MicroStrategy owned 214,246 Bitcoins as of March 19, the most recent figures available in the company’s filings with the Securities and Exchange Commission.Continue reading"
    },
    {
        "Headline": "MicroStrategy Inc (MSTR) Executive Chairman and 10% Owner Michael Saylor Sells Company Shares",
        "Content": "Michael Saylor, Executive Chairman and 10% Owner of MicroStrategy Inc (NASDAQ:MSTR), has sold 3,860 shares of the company on March 27, 2024, according to a recent SEC filing. The transaction was executed at an average price of $1910.16 per share, resulting in a total value of $7,371,217.60.MicroStrategy Inc is a provider of enterprise analytics and mobility software. The company develops software that enables organizations to analyze internal and external data to make business decisions and to develop mobile applications. Its core product is the MicroStrategy platform, which offers capabilities for analytics, mobile, identity, and loyalty applications in a comprehensive enterprise platform.Over the past year, Michael Saylor has engaged in the sale of 270,000 shares of MicroStrategy Inc and has not made any purchases of the stock. The insider transaction history for the company reveals a pattern of 116 insider sells and no insider buys over the same timeframe.MicroStrategy Inc (MSTR) Executive Chairman and 10% Owner Michael Saylor Sells Company SharesOn the valuation front, MicroStrategy Inc's shares were trading at $1910.16 on the day of the insider's recent sale, giving the company a market capitalization of $28.923 billion. The price-earnings ratio stands at 60.49, which is above both the industry median of 27.105 and the company's historical median price-earnings ratio.The stock's price-to-GF-Value ratio is 7.69, with a GF Value of $248.25, indicating that MicroStrategy Inc is significantly overvalued according to GuruFocus's valuation analysis.MicroStrategy Inc (MSTR) Executive Chairman and 10% Owner Michael Saylor Sells Company SharesThe GF Value is determined by considering historical trading multiples such as price-earnings ratio, price-sales ratio, price-book ratio, and price-to-free cash flow, along with a GuruFocus adjustment factor based on the company's past returns and growth, and future business performance estimates from Morningstar analysts.Investors and analysts often monitor insider transactions as they can provide insights into a company's internal perspective on the stock's valuation and future prospects. The recent sale by Michael Saylor may attract attention from the market as stakeholders evaluate the significance of this insider activity.This article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.This article first appeared on GuruFocus."
    },
    {
        "Headline": "MicroStrategy Inc (MSTR) Executive Chairman, 10% Owner Michael Saylor Sells Company Shares",
        "Content": "Michael Saylor, Executive Chairman and 10% Owner of MicroStrategy Inc (NASDAQ:MSTR), has sold 1,140 shares of the company on March 27, 2024, according to a recent SEC filing. The transaction was executed at an average price of $1,951.33 per share, resulting in a total value of $2,224,515.70.MicroStrategy Inc is a provider of enterprise analytics and mobility software. The company develops software to analyze internal and external data in order to make business decisions and to develop mobile apps. Its core product is MicroStrategy 10, which provides interactive dashboards, scorecards, highly formatted reports, ad hoc query, thresholds and alerts, and automated report distribution.Over the past year, the insider has sold a total of 270,000 shares of MicroStrategy Inc and has not made any purchase of the company's shares. The recent sale by Michael Saylor is part of a trend observed over the past year, where there have been no insider buys and 116 insider sells for the company.On the day of the sale, shares of MicroStrategy Inc were trading at $1,951.33, giving the company a market capitalization of $28.923 billion. The price-earnings ratio of the company stands at 60.49, which is above the industry median of 27.105 and also higher than the company's historical median price-earnings ratio.The stock's price of $1,951.33 compared to the GuruFocus Value of $248.25 indicates that MicroStrategy Inc has a price-to-GF-Value ratio of 7.86, suggesting that the stock is Significantly Overvalued according to the GF Value metric.The GF Value is determined by considering historical trading multiples such as price-earnings ratio, price-sales ratio, price-book ratio, and price-to-free cash flow, along with a GuruFocus adjustment factor based on the company's past returns and growth, and future business performance estimates from Morningstar analysts.MicroStrategy Inc (MSTR) Executive Chairman, 10% Owner Michael Saylor Sells Company SharesMicroStrategy Inc (MSTR) Executive Chairman, 10% Owner Michael Saylor Sells Company SharesThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.This article first appeared on GuruFocus."
    },
    {
        "Headline": "Why MicroStrategy Stock Tanked by 11% on Thursday",
        "Content": "The shorts are coming for MicroStrategy (NASDAQ: MSTR), and investors reacted accordingly on Thursday -- well, at least one short seller, which made no bones about what it currently thinks of the tech company-turned-Bitcoin (CRYPTO: BTC) accumulator. As a result, MicroStrategy's share price fell at a double-digit rate, closing more than 11% lower.Short the stock now, says investment firmKerrisdale Capital, an investment firm based in New York City, published a report lambasting MicroStrategy while recommending that investors go long on Bitcoin.Kerrisdale cheekily sub-titled the report \"Know When to HODL, Know When to FODL,\" a play on the \"hold on for dear life\" acronym that is a favorite of crypto investors.The firm is short on MicroStrategy and long on Bitcoin, and it did not mince words about the former. Due to the surging popularity of the leading cryptocurrency, MicroStrategy's shares have generally been on a sharp ride upwards lately.Kerrisdale is uncomfortable with this, writing thatThe bitcoin price currently implied by MicroStrategy's stock is now over $177,000, i.e., two and a half times the spot price of bitcoin. The days when MicroStrategy shares represented a rare, unique way to gain access to bitcoin are long over.The investment firm also pointed out that MicroStrategy's original business, software analytics, currently comprises only 3% of its enterprise value.MicroStrategy has not yet officially responded to the Kerrisdale report.Bound tightly to BitcoinShort sellers tend to get outsized attention, as they are often scathingly critical of the stocks they are shorting. Yet Kerrisdale makes several valid points about MicroStrategy, particularly about how the shares were seen by some investors as a proxy for direct Bitcoin ownership. The company remains heavily dependent on the performance of Bitcoin since it's overwhelmingly its major asset, a situation that might not sit comfortably with many.Story continuesShould you invest $1,000 in MicroStrategy right now?Before you buy stock in MicroStrategy, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and MicroStrategy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024Eric Volkman has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.Why MicroStrategy Stock Tanked by 11% on Thursday was originally published by The Motley Fool"
    },
    {
        "Headline": "MicroStrategy Stock Falls After Short Seller Report",
        "Content": "MicroStrategy stock is falling after a short seller said Thursday the company is overvalued. The hedge fund Kerrisdale Capital said it is long Bitcoin and short MicroStrategy, whose shares have rallied largely due to the soaring value of cryptocurrency owned by the company. “Our thesis is not predicated on a bearish view of bitcoin or MicroStrategy, but rather a belief that the relationship between the two has grown distorted,” wrote the hedge fund, who said the stock trades at a premium of more than two times the value of its bitcoin.Continue reading"
    },
    {
        "Headline": "Sam Bankman-Fried sentenced to 25 years in prison, AMC slumps on stock sale: Yahoo Finance Live",
        "Content": "Disgraced FTX founder and former CEO Sam Bankman-Fried was sentenced to 25 years in federal prison by a New York judge. Bankman-Fried was convicted in November of seven fraud and conspiracy counts. On Wall Street, one of the biggest movers is AMC Entertainment (AMC). Shares of the movie theater company fell sharply after it announced it was selling $250 million worth of stock. Other trending tickers on Yahoo Finance include MicroStrategy (MSTR), Nikola (NKLA), and RH (RH).Top guests today include:3:10 p.m. ET - Dan Ives, Wedbush Securities Managing Director3:35 p.m. ET - Patrick De Haan, GasBuddy Head of Petroleum Analysis3:45 p.m. ET - Geetha Ranganathan, Bloomberg Intelligence Senior Media Analyst, and Jamie Lumley, Third Bridge Group Sector Analyst4:50 p.m. ET - Ethan Brown, Beyond Meat CEO"
    },
    {
        "Headline": "MicroStrategy Slumps 14% After Short Seller Says Stock Trades at an Unjustifiable Premium to Bitcoin",
        "Content": "MicroStrategy's (MSTR) shares fell as much as 14% on Thursday after a prominent short seller, Kerrisdale Capital, said in a report that it is short-selling the stock while betting long on bitcoin {{BTC}}.“Shares of MicroStrategy have soared amid a recent rise in the price of bitcoin, but as is often the case with crypto, things have gotten carried away,” the short seller wrote.None of the reasons cited for the stock’s relative attractiveness “justify paying well over double for the same coin,” the report said.Software developer MicroStrategy’s business model is based on the acquisition and holding of bitcoin, and its crypto stash represents the majority of the company’s valuation. The company now holds about 214,246 bitcoins, which is more than 1% of all the 21 million tokens that will ever exist.MicroStrategy's market cap is about $28 billion. Its bitcoin holdings are worth about $15.2 billion.The report notes that the bitcoin price currently implied by MicroStrategy’s share price is $177,000, which is two and a half times the spot price of the cryptocurrency.“The days when MicroStrategy shares represented a rare, unique way to gain access to bitcoin are long over,” the note said, adding that “bitcoin is now easily obtainable through brokerages, crypto exchanges and more recently low fee exchange-traded products (ETPs) and exchange-traded funds (ETFs).”MicroStrategy didn’t respond to a request for comment before publication.Kerrisdale isn't the only investor selling shares of MicroStrategy short. Total short interest in crypto stocks is $10.7 billion, with MicroStrategy and Coinbase (COIN) making up 84% of the bearish bets, according to a report from S3 Partners.Read more: Crypto Stocks Like MicroStrategy, Coinbase Could Shoot Up if Short Sellers ExitUPDATE (March 28, 15:21 UTC): Updates headline and story throughout to include share price move, company valuation."
    }
]