[
    {
        "Headline": "Could Oracle Become the Next Microsoft?",
        "Content": "Microsoft's (NASDAQ: MSFT) stock surged nearly 1,000% over the past decade and turned it into the world's most valuable company, with a market cap of $3.2 trillion. That massive growth spurt was driven by the expansion of its mobile, cloud, and AI ecosystems under Satya Nadella, who became the company's CEO in 2014.Microsoft is still one of the market's top AI stocks, but investors are probably already looking for the next tech stock that could replicate those gains over the next decade. Could that company be Oracle (NYSE: ORCL), which is also gradually expanding its cloud and AI ecosystems but has a smaller market cap of $350 billion?Image source: Getty Images.The similarities and differencesMicrosoft and Oracle operate different business models. Microsoft is a more diversified company and generates most of its revenue from its Windows operating system, Office productivity software, Azure cloud-based infrastructure platform, and other cloud-based services. It also sells ads in its Bing search engine, PC hardware through its Surface division, and video game products through its Xbox division.Over the past decade, most of Microsoft's growth stemmed from Azure and the conversion of its Office products and Dynamics customer relationship management (CRM) platform into cloud-based services. Its investments in OpenAI also allowed it to integrate the start-up's generative AI tools into its own cloud-based ecosystem.Oracle is one of the world's top database software companies. It initially established an early mover's advantage with its on-premise applications, but Amazon and Microsoft pulled ahead with their own cloud-based database services. To keep pace with that shift, Oracle transformed its on-premise applications to cloud-based services and inorganically expanded its ecosystem with more enterprise resource planning (ERP), CRM, and healthcare IT management services. It also launched its own cloud platform, Oracle Cloud Infrastructure (OCI).Story continuesOracle now ranks third in the cloud-based database software market, behind Amazon and Microsoft, while OCI is still a tiny platform compared to Amazon Web Services (AWS), Microsoft Azure, and Alphabet's Google Cloud. It also ranks third in the CRM market behind Salesforce and Microsoft, and it remains a distant underdog in the fragmented ERP market. That's probably why Oracle isn't often mentioned in the same breath as Microsoft or Amazon.Oracle is still expanding its cloud and AI businessesOracle generated 38% of its revenue from its total cloud services in its latest quarter. By comparison, Microsoft generated 54% of its revenue from its cloud services last quarter.Oracle plans to keep expanding its cloud business to offset the slower growth of its on-premise, licensing, and support divisions. It expects the rising usage of its back office database and ERP applications, the growth of OCI, and a new AI infrastructure contract with Nvidia to drive that expansion and widen its moat.In its latest earnings report, CEO Safra Catz said Oracle expected to \"continue receiving large contracts reserving cloud infrastructure capacity because the demand for our Gen2 AI infrastructure substantially exceeds supply -- despite the fact we are opening new and expanding existing cloud datacenters very, very rapidly.\"But could Oracle replicate Microsoft's gains?In other words, Oracle should benefit from the expansion of the AI market, which Grand View Research expects to grow at a compound annual growth rate (CAGR) of 37% from 2023 to 2030. But a lot of those gains will still be offset by its slower-growing legacy businesses.From fiscal 2023 (which ended last May) to fiscal 2026, analysts expect Oracle's revenue to increase at a CAGR of 8% as its EPS rises at a CAGR of 22%. A large portion of that earnings growth will likely be driven by big buybacks. It already bought back 38% of its shares over the past 10 years, and it should maintain that tradition for the foreseeable future.Those growth rates are stable, but they probably won't turn Oracle into the next Microsoft. From fiscal 2013 to fiscal 2023 (which ended last June), Microsoft grew its revenue at a CAGR of 11% as its EPS rose at a CAGR of 14%. From fiscal 2023 to fiscal 2026, analysts expect its revenue and EPS to increase at a CAGR of 15% and 17%, respectively, as it continues to expand its cloud and AI ecosystems.Assuming Oracle matches analysts' expectations for the next three years, continues to grow its EPS at a CAGR of 20% from fiscal 2026 to fiscal 2033, and trades at 20 times earnings, its stock could more than triple to $400 a share and lift its market cap to about $1.1 trillion. That would be an impressive 10-year gain, but it wouldn't match Microsoft's massive rally over the past decade. It would also still be a lot smaller than today's Microsoft.So instead of wondering if Oracle will shake off its reputation as a dusty old tech stock and become the next Microsoft, investors should focus on its core strengths: it's successfully expanding its own cloud and AI businesses in the shadow of its larger competitors, it's returning plenty of cash to its shareholders, and its stock is still reasonably valued.Should you invest $1,000 in Oracle right now?Before you buy stock in Oracle, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Oracle wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Alphabet, Amazon, Microsoft, Nvidia, Oracle, and Salesforce. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Could Oracle Become the Next Microsoft? was originally published by The Motley Fool"
    },
    {
        "Headline": "Billionaire David Tepper Is Loading Up on These Artificial Intelligence (AI) Stocks -- and Nvidia Isn't One of Them",
        "Content": "David Tepper knows how to make money. His net worth of $20.6 billion could be Exhibit A.The billionaire investor shrewdly initiated a big position in Nvidia in the first quarter of 2023. By the end of the year, the chipmaker's shares had more than tripled. Nvidia ranks as the fourth-largest position in Tepper's Appaloosa Management portfolio.Tepper loaded up on several artificial intelligence (AI) stocks in the fourth quarter of 2023. However, Nvidia wasn't one of them. He slashed Appaloosa's position in the stock by nearly 23%. Here are the three AI stocks the hedge fund manager bought the most in Q4.1. OracleOracle (NYSE: ORCL) wasn't in Appaloosa's portfolio before Q4. However, Tepper initiated a new position in the stock during the quarter worth nearly $140 million at year-end. Oracle is now Appaloosa's 12th-largest holding.What does Tepper like about Oracle? The technology company's growth prospects probably rank at the top of the list.Oracle's adjusted earnings per share jumped 16% year over year in Q4, and customers continue to flock to the company's cloud infrastructure. The scramble to harness the power of generative AI is a key reason why.Is Oracle an AI stock that investors who aren't billionaires should like, too? I think so.The company's price-to-earnings-to-growth (PEG) ratio is a low 1.08x. Oracle has also struck smart partnerships with Nvidia to deliver sovereign AI solutions to global customers and with Microsoft to expand the regions where the Oracle database is available on Microsoft's Azure cloud platform.2. Alibaba Group HoldingTepper increased Appaloosa's stake in Alibaba Group Holding (NYSE: BABA) by nearly 21% in Q4. The Chinese tech stock ranks as the sixth-largest position in the hedge fund's portfolio.The billionaire probably likes Alibaba's potential. The company is a leader in several Chinese markets, including e-commerce, cloud services, logistics, and digital media. However, its valuation doesn't fully reflect its underlying business strength, with shares trading at only 7.8 times forward earnings.Story continuesAlibaba's growth has slowed considerably, largely due to the sluggish Chinese economy. The company has also faced setbacks in executing its business strategy, scrapping plans to spin off its cloud unit and Cainaio logistics subsidiary. Tepper could view Alibaba as a great comeback opportunity.Aggressive investors who can wait patiently for Alibaba to turn things around could make solid long-term gains with this stock. Risk-averse investors, though, are better off staying away from Alibaba, due to the uncertainties associated with investing in Chinese stocks.3. AmazonAppaloosa added more than 5% to its stake in another AI stock: Amazon (NASDAQ: AMZN). The e-commerce and cloud services giant is the third-largest position in the hedge fund's portfolio.Tepper has been a fan of Amazon for a while. He first initiated a position in the stock in the first quarter of 2019. Since then, Amazon's share price has more than doubled.Why does the billionaire still like Amazon? Probably because the company is delivering strong earnings and free-cash-flow growth. Tepper also likely thinks that Amazon Web Services has great opportunities with the ongoing surge in interest in generative AI.All of these are good reasons for other investors to buy Amazon stock, too. Don't overlook the company's efforts to expand into new markets such as healthcare, either.Should you invest $1,000 in Amazon right now?Before you buy stock in Amazon, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Keith Speights has positions in Amazon and Microsoft. The Motley Fool has positions in and recommends Amazon, Microsoft, Nvidia, and Oracle. The Motley Fool recommends Alibaba Group and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Billionaire David Tepper Is Loading Up on These Artificial Intelligence (AI) Stocks -- and Nvidia Isn't One of Them was originally published by The Motley Fool"
    },
    {
        "Headline": "Oracle's NetSuite is getting AI features at no cost to customers",
        "Content": "Oracle's NetSuite is adding a slew of new generative AI features. The bonus for customers? It will cost them nothing to get the new functions.Oracle NetSuite Founder and EVP Evan Goldberg tells Yahoo Finance the new features will allow customers to \"access generative AI for any kind of text that they are producing and it will make appropriate text for however they are using it.\"As for why Oracle (ORCL) isn't charging for the generative AI capabilities, Goldberg says, \"The future of business systems has AI everywhere. I mean, having a business system without AI is going to be like a car without wheels, so it really doesn't make sense.\" He adds, \"We're not going to sell an unintelligent version of our business system.\"Watch the video above to hear how NetSuite's customers are using AI and how Oracle is protecting customer data.Editor's note: This article was written by Stephanie Mikulich.Video TranscriptAKIKO FUJITA: Oracle NetSuite is rolling out a massive upgrade to its products and it's going to cost clients nothing. The new features using generative AI to help with supply chain sales, operations, and finances using a technique called assisted authoring. Evan Goldberg is founder of Oracle NetSuite. He joins us on set now. Good to talk to you today. Tell us how this all works.EVAN GOLDBERG: Well, we're bringing AI to our 37,000-plus customers so that they don't have to become AI experts. They can just use NetSuite and right there in place when they're using the system, the business management system of record for their company that helps them with their finances, their sales, and their HR, they can access generative AI for any kind of text that they're producing. And it'll make appropriate text for however they're using it. In different parts of the system, it operates differently.- And Evan, you're not-- you're not going to charge customers extra for these AI features? Why not, Evan? Everybody else is.EVAN GOLDBERG: Yeah. I mean, the future of business systems has AI everywhere. I mean, having a business system without AI is going to be like a car without wheels. And so it really doesn't make sense. We're not going to sell an unintelligent version of our business system.Story continues- But Evan, you know, it's expensive though, right? I mean Gen AI is expensive. So is there any risk here or are you assuming you take a cost hit with that?EVAN GOLDBERG: We've been in the Cloud business for over 25 years. We were the first cloud company. And what we've seen is that hardware costs, software costs, those types of things tend to work themselves out. And we think we can deliver great value to our customers, and keep our prices how they've been, and deliver all this AI.AKIKO FUJITA: And you've pointed out, this isn't necessarily a premium. This is the norm of where we're going right now. As you talk to some of your clients, you see how businesses are integrating AI, what are you hearing about where it goes from here?EVAN GOLDBERG: Well, we have the benefit of-- we're not trying to build the next moviemaking AI. And that's great that people are doing that. Oracle as a whole has kind of a laser focus on how businesses are going to use AI. So we are out there scouring for the next great advance in dealing with numbers. We don't-- large language models are about words but businesses are largely about numbers and knowing your numbers. So that's our job, is to get this complex technology in the hands of business users that aren't technology experts in a simple way.AKIKO FUJITA: But is it largely about efficiency still? Are we seeing it within HR? I mean how are you using it?EVAN GOLDBERG: Yes, it's definitely about doing more with less. I mean, companies obviously want to be as efficient as possible but then they want to grow. Our customers are fast-growing companies and they want to be able to do things like-- we've been working with AI for many years before generative AI for things like, what are the best products to sell to my customers, who might I be able to expand my sales into. And you know, what salespeople are operating the most effectively and how can I utilize them efficiently.- And Evan, when you make the announcement like today, one natural question, of course, is customer data. What happens with that data. Is it-- is it shared with LLM providers or others? What's your response there?EVAN GOLDBERG: Well, again, you know, Oracle's long history is about securing data. So that's top of mind for us, absolutely. And we use the generative AI service inside Oracle's Cloud Infrastructure so your data stays generally within OCI. And we will make sure that data is 1,000% secure because that's what our customers rely on us for.AKIKO FUJITA: Yeah, working with so many businesses, I mean you certainly have a good pulse on where things are right now. What's the sentiment right now in terms of investing in this technology?EVAN GOLDBERG: You know, again, I think we have companies from so many different industries. And if you talk to a software company, they are really cognizant of everything going on and they have great ideas about how they want to use AI. And we're going to bring more complex features to them.But for your average small business, they're just worrying about how am I going to-- where am I going to make-- next sales are going to come from and how am I going to make payroll? And so for those companies, I think that's where the real promise of what Oracle and NetSuite are doing lies.- Evan, final question here, listen, you got-- you have plenty of rivals, right? Microsoft, SAP. How does what you announced today, Evan, how does it sort of you think differentiate and distinguish you from the competition?EVAN GOLDBERG: Yeah. Well, I mean, AI is data hungry. The best AI comes from the best data. And the way NetSuite works is it's one system. You really have a single source of truth and data about your business. And so I think that's really where our competitive advantage lies, is that the AI can consume information not just from one part of your business but from the entire business- Evan, thanks so much for joining us today. Appreciate it. Thanks for coming on."
    },
    {
        "Headline": "16 Most Profitable Tech Stocks To Invest In",
        "Content": "In this piece, we will take a look at the 16 most profitable tech stocks to invest in. If you want to skip our overview of the technology industry, then you can jump ahead to the 5 Most Profitable Tech Stocks To Invest In.If there's one thing that can be said with certainty it's that technology runs the stock market - both figuratively and literally. Stock trading in 2024 is vastly different from trading in 1924, and at the heart of this shift is the computer. Similarly, back then, the U.S. economy was primarily dominated by industrial firms, meaning that movements in their share prices could end up setting the mood for broader indexes such as the Dow Jones Industrial Average (DJIA).Now, not only do computers run the stock markets, but firms that either make their hardware or software reign supreme in market capitalization as well. The biggest stocks in U.S. markets, and therefore in the world, are technology companies. Some of the most prolific ones due to their trillion dollar valuations are Apple Inc. (NASDAQ:AAPL) and Microsoft Corporation (NASDAQ:MSFT). The two account for a sizeable chunk of U.S. personal computing use, and this also underscores their valuations with investors being well aware of this role.So naturally, 2023 has been the year of technology stocks, and the trend has so far persisted in 2024. This surge in technology stock prices comes after 2022, which was one of the worst years for the industry. In 2022, the semiconductor supply chain was at the start of a major glut, as manufacturers built up inventory based on models that had anticipated demand similar to levels seen during the coronavirus pandemic. These difficulties were exacerbated by high interest rates - which do not bode well for high growth stocks such as technology - and high inflation, which not only stresses corporate budgets but also makes it difficult for consumers to splurge for pricey gadgets such as Apple's 'spatial computing' device, the $3499 Apple Vision Pro.Story continuesYet, as the Vision Pro shows, technology stocks have to potential to continually surprise investors, media, and the public. With the first quarter of the new year now ending, analysts and investors are pouring over the latest products from NVIDIA Corporation (NASDAQ:NVDA) - Wall Street's artificial intelligence darling. NVIDIA recently held its GTC Developers conference, an annual event, where it revealed its latest Blackwell GPU for AI. This GPU promises to reduce operating costs and energy usage by up to 25 times when compared to predecessors.NVIDIA's chief Jensen Huang also provided details about Blackwell's design and costs in an interview with CNBC where he shared:Yes, a mathematician, right? Yeah, yeah, really terrific mathematician. And this computer here will replace thousands of general-purpose computers. This is the part that's incredible. In fact, what's amazing is that the cables of connecting last generation general purpose computers, the cables of connecting them, cost more than the price of one of these computers. The amount of energy that we save is incredible. Megawatts and megawatts and megawatts. Because of this, we made it possible for the computer to write software by itself. It is so insanely fast. Now the software can write. The computer can write its own software. And we call that artificial intelligence.Jensen also highlighted earlier in the talk with CNBC's Jim Cramer that a Blackwell chip can cost as much as $40,000 and that the research and development of the first generation of chips stood at a whopping $10 billion. NVIDIA is currently valued at $2.28 trillion, making the multi billion dollar spend a drop in its massive market capitalization. The shares have gained 248% over the past year, outpacing the S&P 500 Information Technology index's 53% gain over the past year by a wide margin.So, with the dynamics of the global technology industry shifting, we decided to take a look at the top tech stocks in terms of net profit that hedge funds are buying. A couple of notable picks are Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and Alphabet Inc. (NASDAQ:GOOGL).16 Most Profitable Tech Stocks To Invest InPixabay/Public DomainOur Methodology To make our list of the most profitable tech stocks to invest in, we ranked all technology companies by their trailing twelve month net income and picked the top stocks.For these most profitable tech stocks, we used hedge fund sentiment. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.16 Most Profitable Tech Stocks To Invest In16. International Business Machines Corporation (NYSE:IBM)Number of Q4 2023 Hedge Fund Shareholders: 50 Latest Trailing 12 Month Net Income: $7.5 billionInternational Business Machines Corporation (NYSE:IBM) is one of the biggest enterprise computing companies in the world. Following Wall Street's A.I. rally, its shares have been quietly on the rise and have appreciated by 19.5% year to date. This leaves them within highs last reached in 2013.As of Q4 2023 end, 50 out of the 933 hedge funds surveyed by Insider Monkey had bought a stake in International Business Machines Corporation (NYSE:IBM). Peter Rathjens, Bruce Clarke, and John Campbell's Arrowstreet Capital was the firm's biggest investor due to its $528 million stake.International Business Machines Corporation (NYSE:IBM) joins Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Alphabet Inc. (NASDAQ:GOOGL). in our list of the most profitable stocks that hedge funds have bought.15. QUALCOMM Incorporated (NASDAQ:QCOM)Number of Q4 2023 Hedge Fund Shareholders: 78 Latest Trailing 12 Month Net Income: $7.7 billionQUALCOMM Incorporated (NASDAQ:QCOM) is one of the biggest semiconductor designers in the world when it comes to smartphone processors and GPUs. The firm added to the AI hype in March 2024 when it revealed its Snapdragon 7+ Gen 3 processor for on device smartphone AI use.During December 2023, 78 out of the 933 hedge funds covered by Insider Monkey had held a stake in the firm. QUALCOMM Incorporated (NASDAQ:QCOM)'s largest hedge fund shareholder is Josh Overdeck and David Siegel's Two Sigma Advisors as it holds $431 million worth of shares.14. ASML Holding N.V. (NASDAQ:ASML)Number of Q4 2023 Hedge Fund Shareholders: 62 Latest Trailing 12 Month Net Income: $8.48 billionASML Holding N.V. (NASDAQ:ASML) is the backbone of the global chip manufacturing company whose machines are indispensable when it comes to making high end chips. Naturally, the shares are rated Strong Buy on average, and the average share price target is $997.95.For their fourth quarter of 2023 shareholdings, 62 out of the 933 hedge funds profiled by Insider Monkey had bought and owned ASML Holding N.V. (NASDAQ:ASML)'s shares. Jean-Marie Eveillard's First Eagle Investment Management owned the biggest stake which was worth $1.9 billion.13. Oracle Corporation (NYSE:ORCL)Number of Q4 2023 Hedge Fund Shareholders: 100 Latest Trailing 12 Month Net Income: $10.6 billionOracle Corporation (NYSE:ORCL) is one of the biggest enterprise computing companies in the world. The firm made a notable AI announcement in March 2024 when it shared that it had partnered with NVIDIA to deliver sovereign AI all over the world.By the end of 2023's final quarter, 100 out of the 933 hedge funds covered by Insider Monkey's research had invested in the firm. Oracle Corporation (NYSE:ORCL)'s largest hedge fund investor is Jean-Marie Eveillard's First Eagle Investment Management due to its $1.9 billion investment.12. Broadcom Inc. (NASDAQ:AVGO)Number of Q4 2023 Hedge Fund Shareholders: 91 Latest Trailing 12 Month Net Income: $11.6 billionBroadcom Inc. (NASDAQ:AVGO) is a semiconductor designer that focuses on connectivity products. Its investors were in for some good news in March 2024 when TD Cowen upgraded the shares to Outperform from Market Perform and raised the share price target to $1,500 from $1,400.Insider Monkey dug through 933 hedge fund portfolios for their December quarter of 2023 shareholdings and discovered 91 Broadcom Inc. (NASDAQ:AVGO) stakeholders. Ken Fisher's Fisher Asset Management owned the biggest stake which was worth $2.3 billion.11. Cisco Systems, Inc. (NASDAQ:CSCO)Number of Q4 2023 Hedge Fund Shareholders: 60 Latest Trailing 12 Month Net Income: $13.4 billionCisco Systems, Inc. (NASDAQ:CSCO) is a global networking equipment manufacturer headquartered in San Jose, California. The shares are rated Buy on average, and the average analyst share price target is $53.47.As of Q4 2023 end, 60 out of the 933 hedge funds covered by Insider Monkey's research had piled into the connectivity stock. Cisco Systems, Inc. (NASDAQ:CSCO)'s largest hedge fund investor is Peter Rathjens, Bruce Clarke, and John Campbell's Arrowstreet Capital as it owns 22.6 million shares that are worth $1.1 billion.10. Alibaba Group Holding Limited (NYSE:BABA)Number of Q4 2023 Hedge Fund Shareholders: 116 Latest Trailing 12 Month Net Income: $13.75 billionAlibaba Group Holding Limited (NYSE:BABA) is a Chinese eCommerce and technology giant headquartered in Hangzhou, China. Amidst a troubled Chinese economy that has seen widespread pain, Alibaba Group Holding Limited (NYSE:BABA) appeared to be focusing on its core businesses in March 2024 when it cut stakes in an electric vehicle company.During December 2023, 116 among the 933 hedge funds part of Insider Monkey's database had bought Alibaba Group Holding Limited (NYSE:BABA)'s shares. David Tepper's Appaloosa Management LP was the biggest investor through its $337 million investment.9. Tesla, Inc. (NASDAQ:TSLA)Number of Q4 2023 Hedge Fund Shareholders: 82 Latest Trailing 12 Month Net Income: $14.9 billionTesla, Inc. (NASDAQ:TSLA) is one of the more interesting companies on the stock market due to its reliance on key technologies used in car fabrication and data analytics. Its early mover advantage in the electric vehicle industry has provided Tesla, Inc. (NASDAQ:TSLA) with a chance to build a sizeable presence and collect data for assisted driving technologies. The firm's investors continued to deal with uncertainty in March 2024, particularly after a Chinese rival reduced its delivery forecasts for the year.For their final quarter of 2023 investments, 82 out of the 933 hedge funds profiled by Insider Monkey were the firm's shareholders. Tesla, Inc. (NASDAQ:TSLA)'s largest hedge fund stakeholder is Philippe Laffont's Coatue Management as it holds a $1 billion stake.8. Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM)Number of Q4 2023 Hedge Fund Shareholders: 105 Latest Trailing 12 Month Net Income: $26.27 billionTaiwan Semiconductor Manufacturing Company Limited (NYSE:TSM) is the world's largest contract chip manufacturer whose products power a sizeable chunk of the global high performance computing and smartphone industries. TSMC's importance in the global semiconductor industry was evident from the fact that NVIDIA CEO Jensen Huang called the firm one of NVIDIA's closest partners earlier this month at the NVIDIA GTC.After digging through 933 hedge fund portfolios for their December quarter of 2023 shareholdings, Insider Monkey found that 105 had bought and owned Taiwan Semiconductor Manufacturing Company Limited (NYSE:TSM)'s shares. Ken Fisher's Fisher Asset Management was the largest shareholder, owning 31 million shares that are worth $3.2 billion.7. Tencent Holdings Limited (OTC:TCEHY)Number of Q4 2023 Hedge Fund Shareholders: N/A Latest Trailing 12 Month Net Income: $26.81 billionTencent Holdings Limited (OTC:TCEHY) is one of the biggest and diversified technology companies in the world with a sizeable presence in key areas such as financial technology and artificial intelligence. Its latest financial results provided a crucial set of figures that saw Tencent Holdings Limited (OTC:TCEHY) struggle to meet revenue growth expectations. This underscored a weakness in the Chinese economy, but the firm's CEO shared that a strong development pipeline can help Tencent Holdings Limited (OTC:TCEHY) in the future.6. NVIDIA Corporation (NASDAQ:NVDA)Number of Q4 2023 Hedge Fund Shareholders: 174 Latest Trailing 12 Month Net Income: $29.7 billionNVIDIA Corporation (NASDAQ:NVDA) is the hottest stock in the technology sector right now due to its AI chips. However, the average share price target of $891.78 which comes courtesy of 46 analyst estimates is slightly lower than the trading price. NVIDIA Corporation (NASDAQ:NVDA)'s shares are nevertheless rated Strong Buy on average, as Wall Street remains optimistic of the secular shift to artificial intelligence in the data science industry.174 out of the 933 hedge funds surveyed by Insider Monkey during Q4 2023 were NVIDIA Corporation (NASDAQ:NVDA)'s investors. Out of these, Rajiv Jain's GQG Partners was the biggest investor as it owned a $6.8 billion stake.Microsoft Corporation (NASDAQ:MSFT), NVIDIA Corporation (NASDAQ:NVDA), Apple Inc. (NASDAQ:AAPL), and Alphabet Inc. (NASDAQ:GOOGL) are some highly profitable tech stocks that hedge funds are buying.Click to continue reading and see 5 Most Profitable Tech Stocks To Invest In.Suggested Articles:Disclosure. None. 16 Most Profitable Tech Stocks To Invest In was initially published on Insider Monkey."
    },
    {
        "Headline": "Here's What To Make Of Oracle's (NYSE:ORCL) Decelerating Rates Of Return",
        "Content": "Did you know there are some financial metrics that can provide clues of a potential multi-bagger? Typically, we'll want to notice a trend of growing return on capital employed (ROCE) and alongside that, an expanding base of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. With that in mind, the ROCE of Oracle (NYSE:ORCL) looks decent, right now, so lets see what the trend of returns can tell us.Return On Capital Employed (ROCE): What Is It?Just to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business. The formula for this calculation on Oracle is:Return on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)0.14 = US$15b ÷ (US$137b - US$25b) (Based on the trailing twelve months to February 2024).Therefore, Oracle has an ROCE of 14%. In absolute terms, that's a satisfactory return, but compared to the Software industry average of 7.3% it's much better. View our latest analysis for Oracle roceAbove you can see how the current ROCE for Oracle compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like, you can check out the forecasts from the analysts covering Oracle  for free.The Trend Of ROCEThe trend of ROCE doesn't stand out much, but returns on a whole are decent. The company has employed 23% more capital in the last five years, and the returns on that capital have remained stable at 14%. 14% is a pretty standard return, and it provides some comfort knowing that Oracle has consistently earned this amount. Over long periods of time, returns like these might not be too exciting, but with consistency they can pay off in terms of share price returns.The Bottom Line On Oracle's ROCETo sum it up, Oracle has simply been reinvesting capital steadily, at those decent rates of return. On top of that, the stock has rewarded shareholders with a remarkable 151% return to those who've held over the last five years. So even though the stock might be more \"expensive\" than it was before, we think the strong fundamentals warrant this stock for further research.Story continuesIf you want to continue researching Oracle, you might be interested to know about the 1 warning sign that our analysis has discovered.While Oracle isn't earning the highest return, check out this free list of companies that are earning high returns on equity with solid balance sheets.Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned."
    },
    {
        "Headline": "Oracle Corp CEO Safra Catz Sells 2,750,000 Shares",
        "Content": "Oracle Corp (NYSE:ORCL) has reported a significant insider sell by CEO Safra Catz, according to a recent SEC filing. On March 27, 2024, the insider executed a sale of 2,750,000 shares of the company. This transaction has caught the attention of investors and market analysts, as insider activity can provide insights into a company's financial health and future prospects.Oracle Corp, a global provider of enterprise cloud computing and software services, is known for its comprehensive and fully integrated stack of cloud applications, platform services, and engineered systems. The company's offerings include a wide array of software as a service, platform as a service, infrastructure as a service, and data as a service capabilities.Over the past year, Safra Catz has sold a total of 7,750,000 shares and has not made any share purchases. This latest transaction continues the trend of insider selling at Oracle Corp, with a total of 14 insider sells and no insider buys reported over the same period.Oracle Corp CEO Safra Catz Sells 2,750,000 SharesOn the valuation front, Oracle Corp shares were trading at $126.1 on the day of the insider's recent sale, resulting in a market capitalization of $344.31 billion. The company's price-earnings ratio stands at 33.05, which is above both the industry median of 27.09 and Oracle Corp's historical median price-earnings ratio.Oracle Corp CEO Safra Catz Sells 2,750,000 SharesThe stock's price relative to the GuruFocus Value (GF Value) indicates that Oracle Corp is modestly overvalued. With a share price of $126.1 and a GF Value of $109.89, the price-to-GF-Value ratio is 1.15. The GF Value is calculated based on historical trading multiples, a GuruFocus adjustment factor, and future business performance estimates provided by Morningstar analysts.The insider's decision to sell a substantial number of shares may be interpreted in various ways by investors. However, it is essential to consider the broader context of the company's performance, market conditions, and the insider's personal financial decisions when evaluating the significance of this transaction.Story continuesThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.This article first appeared on GuruFocus."
    },
    {
        "Headline": "AI Stocks Oracle, ServiceNow, Retail Giant Target Are Mutual Fund Favorites",
        "Content": "AI stocks Oracle and ServiceNow, along with Target stock, are among mutual fund favorites in today's stock market action.Continue reading"
    },
    {
        "Headline": "Forget Tesla: 1 Unstoppable Artificial Intelligence (AI) Stock Belongs in the \"Magnificent Seven\" Instead",
        "Content": "The \"Magnificent Seven\" is a group of seven of the world's largest technology stocks. Last year, they delivered an average return of 112%, which crushed the 24% gain in the benchmark S&P 500 index. The seven stocks include:Nvidia Meta PlatformsApple Microsoft Alphabet (Google)Amazon Tesla (NASDAQ: TSLA)However, the Magnificent Seven has splintered in the early stages of 2024, with Apple and Tesla trading in the red despite the 10% gain in the S&P 500. Tesla's whopping 31% year-to-date loss has prompted some Wall Street analysts to call for its removal from the Magnificent Seven.Tesla's core business is strugglingTesla is working on several artificial intelligence (AI)-powered innovations like fully autonomous self-driving software and humanoid robots, but 85% of its revenue still comes from selling electric vehicles (EVs). The company sold a record-high 1.8 million cars last year, but it represented growth of 38% compared to its 2022 result, which was far below CEO Elon Musk's 50% target.Growth will likely decelerate further in 2024. Tesla neglected to offer a forecast for vehicle deliveries, leaving some analysts to speculate the number could come in at around 2.2 million. That would represent an increase of 22%, and it's worth noting Musk also omitted his usual 50% average annual growth target in Tesla's most recent financial report.Tesla slashed the price of its vehicles by an average of 25.1% throughout 2023 to spur demand in the wake of tough economic conditions, which sent its earnings per share (profit) sinking 23% to $3.12. That places its stock at a price-to-earnings (P/E) ratio of 54.7, which is still significantly more expensive than the 31.1 P/E of the tech-heavy Nasdaq-100 index.Therefore, there is a clear case for further downside in Tesla stock in the short term. The long term might be a different story, depending on the success of the company's other initiatives beyond EV sales.Story continuesImage source: Tesla.The stock that should replace Tesla in the Magnificent SevenThe current Magnificent Seven companies have one thing in common: They are developing AI technologies. If Tesla were removed from the group, I think Oracle (NYSE: ORCL) would be a stellar replacement.Oracle has emerged as a powerhouse in cloud computing, and it's building some of the best data center infrastructure for AI developers using Nvidia's industry-leading graphics processing units (GPUs). Chairman Larry Ellison says Oracle's GPU cluster technology inside its new Gen2 Cloud infrastructure allows businesses to train AI twice as fast and at half the cost of competing clouds.As a result, Gen2 Cloud has already attracted billions of dollars in commitments from some of the AI industry's leading start-ups, from Cohere to Elon Musk's xAI, but Ellison says Oracle simply can't keep up with demand. The company has 40 AI bookings worth at least $1 billion each that haven't come online because they are waiting for additional infrastructure to be built.During the fiscal 2024 second quarter (ended Nov. 30, 2023), Oracle said it had 66 active data center regions around the world. It's currently upgrading all of them to suit AI, and it's in the process of building 100 more, which is a substantial increase in the company's footprint.Oracle Cloud Infrastructure revenue is soaringOracle reports Gen2 Cloud revenue under its Oracle Cloud Infrastructure (OCI) segment. OCI revenue soared 49% year over year to $1.8 billion during Q3, making it the company's fastest growing component. It still only accounted for 13.5% of Oracle's total revenue, but Ellison thinks OCI will grow by 50% for several years to come so it won't be long before it's a significant contributor.Oracle's data center technology is also unique in that it's completely automated. That means there is very little cost difference between operating 10 locations and 100 locations, so it scales incredibly well and delivers strong profitability.On that note, despite Oracle's total revenue growing by just 7% to $13.3 billion in Q3, the company's earnings per share jumped 25% to $0.85. Careful cost management was a contributor to the strong result, but there was also a significant increase in gross profit margin on the infrastructure side. The latter will continue to improve as more data centers come online.Oracle stock is far cheaper than TeslaOracle stock is up 22.8% this year, which is more than twice the gain of the S&P 500 index, and it's sitting near an all-time high. The company will wrap up its fiscal 2024 full year on May 31, and Wall Street predicts its earnings per share will land at around $5.59.That will place Oracle stock at a P/E ratio of 22.8, which is less than half the P/E ratio of Tesla. It's also a 27% discount to the Nasdaq-100 index, implying Oracle is much cheaper than most of its peers in big tech.But it gets better. Oracle's bookings (which are expected to eventually convert to revenue) hit a record high of $80 billion during Q3, which was a 29% year-over-year increase. Bookings clearly grew substantially faster than the company's revenue during the quarter, which implies its top line could accelerate in the near future.Given Oracle's relatively cheap valuation, its rapid growth in OCI, and its large bookings backlog, the company's stock might be poised for several years of steady upside. In fact, Oracle is worth $351 billion as of this writing and I think it could reach a $1 trillion valuation within the next decade.Should you invest $1,000 in Oracle right now?Before you buy stock in Oracle, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Oracle wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks*Stock Advisor returns as of March 25, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Anthony Di Pizio has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Oracle, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Forget Tesla: 1 Unstoppable Artificial Intelligence (AI) Stock Belongs in the \"Magnificent Seven\" Instead was originally published by The Motley Fool"
    }
]