[
    {
        "Headline": "Bitcoin rally continues above new record $73K",
        "Content": "Bitcoin (BTC-USD) keeps on rolling, leading the charge in the crypto rally as it soars past $73,000, another record high for the digital asset in 2024.Yahoo Finance Senior Markets Reporter Jared Blikre analyzes bitcoin's multi-year performance, turning his attention to ethereum's (ETH-USD) gains and the tremendous inflows moving into US-listed spot bitcoin ETFs.For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.Editor's note: This article was written by Luke Carberry Mogan.Video TranscriptMADISON MILLS: Bitcoin surpassing its record high this week, notching a fresh record of $73,000 after a roller coaster week for this volatile digital currency, to say the least. To break down Bitcoin's moves for us, we've got Yahoo Finance's very own Jared Blikre here. Jared, what are you seeing?JARED BLIKRE: Well, another record high. And let's look at the price action over the last five days. Here, we did over the weekend, we came in to the week at about 68,000. We took a little bit of a dip Monday, and then we rallied to just short of 60-- or excuse me, 72,000 or so. And then we sold off all the way down to 69,000 yesterday. A rather dramatic reaction, it looked like, to CPI. But now, we are back at these fresh records.And just looking at a longer term-- this is a 5-year chart where we can see these record highs in the rearview mirror now. A lot of people ask, OK, well, now that we're at record highs, what is the target? You have big, round psychological numbers, so 100,000 is a real easy target. There's all kinds of ways to come up with Fibonacci extensions and other methods with measured moves of coming up with higher highs that are potential higher highs than existing prices, but probably save that for another day.What I do want to show you is what's happened in the crypto market over the last seven days. Here, we have Binance token, left for dead but up 25%. Got the settlement with CZ probably in the rearview mirror. ALGO's up 14%. Litecoin having a great week, 10%.Story continuesSo my point is it's not just the big guys like Ethereum and Bitcoin that have been surging recently. It's a lot of other stuff here. And that was something that was missing in the run up in Bitcoin last year. We did not have that broad participation.Now Ethereum-- this is a 5-year chart similar to Bitcoin, but it is not yet taken out these record highs. 4,500 is the big number, although it did pop a little bit above that.And finally, I just want to show what's been happening with the Bitcoin ETFs. This is a huge new asset class. And I'm getting reminders of that back when GLD-- that is the first gold ETF launched in 2004. Very similar time. Before that, there was not a good way for retail investors to get into gold. You could own physical gold. You could do some other things. But for the most part, the ETF made it mainstream.This is saying here, two of the top five ETFs in terms of flows this year in the United States are Bitcoin. And we're talking $10 billion for IBIT. That's the iShares Bitcoin ETF. And then the Fidelity one, $6.2 billion. These are just high numbers. And in my opinion, it's difficult to see it not increasing from here. There's just a lot of momentum behind the sector. And so my ETF analogy remains, GLD is to some of these ETFs now."
    },
    {
        "Headline": "Bitcoin soars above record $72K: What ETF inflows look like",
        "Content": "Bitcoin (BTC-USD) breaks higher above its record benchmark of $72,000. Investors continue injecting money into spot bitcoin ETFs, led by Grayscale's Bitcoin Trust (GBTC).Yahoo Finance Senior Reporter Jared Blikre monitors the investment inflows of the top-performing bitcoin ETFs and the broad-based rally in the crypto space over the past week.For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.Editor's note: This article was written by Luke Carberry Mogan.Video TranscriptRACHELLE AKUFFO: Well, Bitcoin's record rally showing no signs of slowing down. Now, topping $72,000 for the first time ever. \"Yahoo Finance's\" Jared Blikre is here with a breakdown. You know people who've been holding on for dear life, just rubbing their hands here, happy to see this.JARED BLIKRE: I've had a lot of people call me saying, should I sell, because I am now break even? And I have not-- I have been bullish. And I remain bullish. We don't even have $100,000 in the sights yet.We'll get to some technical analysis in a minute. But I want to show what's happening with the spot Bitcoin ETFs. Many of which were launched only earlier this year, except for the Grayscale one, which converted to an ETF from an ETN. It is by and far the largest. It has $27.4 billion in assets.Number two, though, and three, closely on its heels. We have IBIT that is the iShares offering there. That's $13.6 billion in size. And then $8.6 billion for the Fidelity offering. In a distant fourth place, we have Ark. That's $2.6 billion. And then a number of other contenders, which when you add them up are not that much bigger than Ark.Another interesting phenomenon going on. If you survey the entire universe of US ETFs and you look at the inflows that they've gotten year-to-date, we now have two candidates here, two Bitcoin ETFs among the top five. And that is huge.So you take a look at VOO, IVV. Those are the Vanguard and iShares S&P 500 offerings. You take a look at VTI. That's total market US. Anyway, these are very passive investment vehicles here. So for IBIT, which is iShares, to pull in $10 billion is just a phenomenal leap here. And Eric Balchunas over at Bloomberg along with James Seyffart have been calling this the greatest launch of a new asset class ETF in forever.Story continuesSo here, we have Tesla. I'm actually, looking for Bitcoin. And here, we should have our heat map. And there we go Bitcoin up 4%. We have now eclipsed those record highs. And so we're in uncharted territory. We had a huge reaction off of $68,000. That was the former test and then break of the record high.But now, it's off to the races. And one of the things I find interesting is the rise of these other coins, the alt coins, which have really lagged. There's Binance. This is over the last seven days. Binance up 31%, Algo, 25%, Litecoin, haven't seen that in forever, topping our leaderboard. That is up 19%. And those are all outshining the big guys, Bitcoin and Ethereum.And so that's really what it takes for a healthy rally. You need breadth."
    }
]